#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 835cfde588c593042fe4701cd059bcef.pdb
; shader hash: 835cfde588c593042fe4701cd059bcef
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Compute Shader
; NumThreads=(32,32,1)
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 0
; SigOutputElements: 0
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 0
; SigOutputVectors[0]: 0
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       float2 kRcpScale;                             ; Offset:    0
;       float kA;                                     ; Offset:    8
;   
;   } CB0;                                            ; Offset:    0 Size:    12
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !57, globals: !110)
!1 = !DIFile(filename: "Shaders\5CBicubicUpsampleFast32CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22, !29, !30, !39}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 23, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 23, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 78, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 78, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 78, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 78, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 81, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 81, size: 64, align: 32, elements: !24, templateParams: !27)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 81, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 81, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !{!28, !12}
!28 = !DITemplateTypeParameter(name: "element", type: !13)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 49, baseType: !18)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 104, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 104, size: 128, align: 32, elements: !32, templateParams: !37)
!32 = !{!33, !34, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, line: 104, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, line: 104, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !31, file: !1, line: 104, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !31, file: !1, line: 104, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!37 = !{!11, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x4", file: !1, line: 17, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 4>", file: !1, line: 17, size: 384, align: 32, elements: !41, templateParams: !54)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!54 = !{!11, !55, !56}
!55 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!56 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!57 = !{!58, !70, !80, !84, !85, !88, !89, !92, !96, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!58 = !DISubprogram(name: "main", scope: !59, file: !59, line: 71, type: !60, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!59 = !DIFile(filename: "Shaders/BicubicUpsampleCS.hlsl", directory: "")
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62, !62, !62, !29}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 49, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 49, size: 96, align: 32, elements: !64, templateParams: !68)
!64 = !{!65, !66, !67}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !63, file: !1, line: 49, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !63, file: !1, line: 49, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !63, file: !1, line: 49, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!68 = !{!21, !69}
!69 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!70 = !DISubprogram(name: "StoreLDS", linkageName: "\01?StoreLDS@@YAXIV?$vector@M$02@@@Z", scope: !59, file: !59, line: 52, type: !71, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !29, !73}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 129, baseType: !74)
!74 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 129, size: 96, align: 32, elements: !75, templateParams: !79)
!75 = !{!76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !74, file: !1, line: 129, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !74, file: !1, line: 129, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !74, file: !1, line: 129, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!79 = !{!11, !69}
!80 = !DISubprogram(name: "GetBicubicFilterWeights", linkageName: "\01?GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z", scope: !81, file: !81, line: 29, type: !82, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false)
!81 = !DIFile(filename: "Shaders/BicubicFilterFunctions.hlsli", directory: "")
!82 = !DISubroutineType(types: !83)
!83 = !{!30, !8, !8}
!84 = !DISubprogram(name: "ComputeWeights", linkageName: "\01?ComputeWeights@@YA?AV?$vector@M$03@@MM@Z", scope: !81, file: !81, line: 24, type: !82, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DISubprogram(name: "W2", linkageName: "\01?W2@@YAMMM@Z", scope: !81, file: !81, line: 19, type: !86, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false)
!86 = !DISubroutineType(types: !87)
!87 = !{!8, !8, !8}
!88 = !DISubprogram(name: "W1", linkageName: "\01?W1@@YAMMM@Z", scope: !81, file: !81, line: 14, type: !86, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DISubprogram(name: "LoadSamples", linkageName: "\01?LoadSamples@@YA?AV?$matrix@M$02$03@@II@Z", scope: !59, file: !59, line: 60, type: !90, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false)
!90 = !DISubroutineType(types: !91)
!91 = !{!39, !29, !29}
!92 = !DISubprogram(name: "RemoveDisplayProfile", linkageName: "\01?RemoveDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !93, file: !93, line: 114, type: !94, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false)
!93 = !DIFile(filename: "Shaders/ShaderUtility.hlsli", directory: "")
!94 = !DISubroutineType(types: !95)
!95 = !{!73, !73, !13}
!96 = !DISubprogram(name: "RemoveSRGBCurve", linkageName: "\01?RemoveSRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !97, file: !97, line: 43, type: !98, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!97 = !DIFile(filename: "Shaders/ColorSpaceUtility.hlsli", directory: "")
!98 = !DISubroutineType(types: !99)
!99 = !{!73, !73}
!100 = !DISubprogram(name: "RGBLimitedToFull10bit", linkageName: "\01?RGBLimitedToFull10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !93, file: !93, line: 76, type: !98, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false)
!101 = !DISubprogram(name: "RemoveREC709Curve", linkageName: "\01?RemoveREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !97, file: !97, line: 68, type: !98, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false)
!102 = !DISubprogram(name: "REC2020toREC709", linkageName: "\01?REC2020toREC709@@YA?AV?$vector@M$02@@V1@@Z", scope: !97, file: !97, line: 131, type: !98, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!103 = !DISubprogram(name: "RemoveREC2084Curve", linkageName: "\01?RemoveREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !97, file: !97, line: 86, type: !98, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false)
!104 = !DISubprogram(name: "ApplyDisplayProfile", linkageName: "\01?ApplyDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !93, file: !93, line: 94, type: !94, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!105 = !DISubprogram(name: "ApplySRGBCurve", linkageName: "\01?ApplySRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !97, file: !97, line: 37, type: !98, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!106 = !DISubprogram(name: "RGBFullToLimited10bit", linkageName: "\01?RGBFullToLimited10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !93, file: !93, line: 71, type: !98, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!107 = !DISubprogram(name: "ApplyREC709Curve", linkageName: "\01?ApplyREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !97, file: !97, line: 63, type: !98, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!108 = !DISubprogram(name: "ApplyREC2084Curve", linkageName: "\01?ApplyREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !97, file: !97, line: 75, type: !98, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!109 = !DISubprogram(name: "REC709toREC2020", linkageName: "\01?REC709toREC2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !97, file: !97, line: 120, type: !98, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!110 = !{!111, !113, !115, !119, !120, !121, !125, !127, !143}
!111 = !DIGlobalVariable(name: "kRcpScale", linkageName: "\01?kRcpScale@CB0@@3V?$vector@M$01@@B", scope: !0, file: !59, line: 23, type: !112, isLocal: false, isDefinition: true)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!113 = !DIGlobalVariable(name: "kA", linkageName: "\01?kA@CB0@@3MB", scope: !0, file: !59, line: 24, type: !114, isLocal: false, isDefinition: true)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!115 = !DIGlobalVariable(name: "g_R", linkageName: "\01?g_R@@3PAMA", scope: !0, file: !59, line: 47, type: !116, isLocal: false, isDefinition: true, variable: [1024 x float] addrspace(3)* @"\01?g_R@@3PAMA")
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32768, align: 32, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 1024)
!119 = !DIGlobalVariable(name: "g_G", linkageName: "\01?g_G@@3PAMA", scope: !0, file: !59, line: 48, type: !116, isLocal: false, isDefinition: true, variable: [1024 x float] addrspace(3)* @"\01?g_G@@3PAMA")
!120 = !DIGlobalVariable(name: "g_B", linkageName: "\01?g_B@@3PAMA", scope: !0, file: !59, line: 49, type: !116, isLocal: false, isDefinition: true, variable: [1024 x float] addrspace(3)* @"\01?g_B@@3PAMA")
!121 = !DIGlobalVariable(name: "Source", linkageName: "\01?Source@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !59, line: 18, type: !122, isLocal: false, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 18, size: 128, align: 32, elements: !2, templateParams: !123)
!123 = !{!124}
!124 = !DITemplateTypeParameter(name: "element", type: !74)
!125 = !DIGlobalVariable(name: "Dest", linkageName: "\01?Dest@@3V?$RWTexture2D@V?$vector@M$02@@@@A", scope: !0, file: !59, line: 19, type: !126, isLocal: false, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 3> >", file: !1, line: 19, size: 96, align: 32, elements: !2, templateParams: !123)
!127 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC2020toREC709@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !102, file: !97, line: 133, type: !128, isLocal: false, isDefinition: true)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 133, baseType: !130)
!130 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 133, size: 288, align: 32, elements: !131, templateParams: !141)
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !130, file: !1, line: 133, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !130, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !130, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !130, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !130, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !130, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !130, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !130, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !130, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!141 = !{!11, !55, !142}
!142 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!143 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC709toREC2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !109, file: !97, line: 122, type: !128, isLocal: false, isDefinition: true)
!144 = !{i32 2, !"Dwarf Version", i32 4}
!145 = !{i32 2, !"Debug Info Version", i32 3}
!146 = !{!"dxcoob 1.8.2502.11 (239921522)"}
!147 = !{!"Shaders\5CBicubicUpsampleFast32CS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// The \22fast path\22 Lanczos filter can be used when the source tile dimensions\0D\0A// plus the border pixels (3) fit inside 16x16.  This reduces bandwidth and\0D\0A// uses more efficient Math.  To determine this case, use the following logic:\0D\0A// \0D\0A// bool EnableFastPath = all(srcDim.xy / dstDim.xy <= 29.0 / 32.0);\0D\0A//\0D\0A\0D\0A#define TILE_DIM_X 32\0D\0A#define TILE_DIM_Y 32\0D\0A#define ENABLE_FAST_PATH 1\0D\0A#include \22BicubicUpsampleCS.hlsl\22\0D\0A"}
!148 = !{!"Shaders\5CBicubicFilterFunctions.hlsli", !"//\0A// Copyright (c) Microsoft. All rights reserved.\0A// This code is licensed under the MIT License (MIT).\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0A//\0A// Developed by Minigraph\0A//\0A// Author:  James Stanard\0A//\0A\0Afloat W1(float x, float A)\0A{\0A    return x * x * ((A + 2) * x - (A + 3)) + 1.0;\0A}\0A\0Afloat W2(float x, float A)\0A{\0A    return A * (x * (x * (x - 5) + 8) - 4);\0A}\0A\0Afloat4 ComputeWeights(float d1, float A)\0A{\0A    return float4(W2(1.0 + d1, A), W1(d1, A), W1(1.0 - d1, A), W2(2.0 - d1, A));\0A}\0A\0Afloat4 GetBicubicFilterWeights(float offset, float A)\0A{\0A    //return ComputeWeights(offset, A);\0A\0A    // Precompute weights for 16 discrete offsets\0A    const float4 FilterWeights[16] =\0A    {\0A        ComputeWeights( 0.5 / 16.0, -0.5),\0A        ComputeWeights( 1.5 / 16.0, -0.5),\0A        ComputeWeights( 2.5 / 16.0, -0.5),\0A        ComputeWeights( 3.5 / 16.0, -0.5),\0A        ComputeWeights( 4.5 / 16.0, -0.5),\0A        ComputeWeights( 5.5 / 16.0, -0.5),\0A        ComputeWeights( 6.5 / 16.0, -0.5),\0A        ComputeWeights( 7.5 / 16.0, -0.5),\0A        ComputeWeights( 8.5 / 16.0, -0.5),\0A        ComputeWeights( 9.5 / 16.0, -0.5),\0A        ComputeWeights(10.5 / 16.0, -0.5),\0A        ComputeWeights(11.5 / 16.0, -0.5),\0A        ComputeWeights(12.5 / 16.0, -0.5),\0A        ComputeWeights(13.5 / 16.0, -0.5),\0A        ComputeWeights(14.5 / 16.0, -0.5),\0A        ComputeWeights(15.5 / 16.0, -0.5)\0A    };\0A\0A    return FilterWeights[(uint)(offset * 16.0)];\0A}\0A"}
