#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float    y  
; TexCoord                 0   xy          1     NONE   float   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyz         0   TARGET   float   xyz 
;
; shader debug name: 061b8aa2b80fd39c3ad8397a75291ff4.pdb
; shader hash: 061b8aa2b80fd39c3ad8397a75291ff4
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 2
; SigOutputElements: 1
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 2
; SigOutputVectors[0]: 1
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TexCoord                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33, globals: !63)
!1 = !DIFile(filename: "Shaders\5CBicubicHorizontalUpsamplePS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !13, !15, !26}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 48, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 48, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 48, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 50, baseType: !14)
!14 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 31, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 31, size: 128, align: 32, elements: !17, templateParams: !23)
!17 = !{!18, !20, !21, !22}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 31, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 31, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 31, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !16, file: !1, line: 31, baseType: !19, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!23 = !{!24, !25}
!24 = !DITemplateTypeParameter(name: "element", type: !19)
!25 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 30, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 30, size: 64, align: 32, elements: !28, templateParams: !31)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, line: 30, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, line: 30, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!31 = !{!32, !12}
!32 = !DITemplateTypeParameter(name: "element", type: !14)
!33 = !{!34, !51, !55, !56, !59, !60}
!34 = !DISubprogram(name: "main", scope: !1, file: !1, line: 44, type: !35, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !15, !45}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 31, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 31, size: 96, align: 32, elements: !39, templateParams: !43)
!39 = !{!40, !41, !42}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !1, line: 31, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !38, file: !1, line: 31, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !38, file: !1, line: 31, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !{!24, !44}
!44 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 31, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 31, size: 64, align: 32, elements: !47, templateParams: !50)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !46, file: !1, line: 31, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !46, file: !1, line: 31, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!50 = !{!24, !12}
!51 = !DISubprogram(name: "GetBicubicFilterWeights", linkageName: "\01?GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z", scope: !52, file: !52, line: 29, type: !53, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DIFile(filename: "Shaders/BicubicFilterFunctions.hlsli", directory: "")
!53 = !DISubroutineType(types: !54)
!54 = !{!15, !19, !19}
!55 = !DISubprogram(name: "ComputeWeights", linkageName: "\01?ComputeWeights@@YA?AV?$vector@M$03@@MM@Z", scope: !52, file: !52, line: 24, type: !53, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubprogram(name: "W2", linkageName: "\01?W2@@YAMMM@Z", scope: !52, file: !52, line: 19, type: !57, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false)
!57 = !DISubroutineType(types: !58)
!58 = !{!19, !19, !19}
!59 = !DISubprogram(name: "W1", linkageName: "\01?W1@@YAMMM@Z", scope: !52, file: !52, line: 14, type: !57, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubprogram(name: "GetColor", linkageName: "\01?GetColor@@YA?AV?$vector@M$02@@II@Z", scope: !1, file: !1, line: 34, type: !61, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DISubroutineType(types: !62)
!62 = !{!37, !13, !13}
!63 = !{!64, !66, !68}
!64 = !DIGlobalVariable(name: "TextureSize", linkageName: "\01?TextureSize@Constants@@3V?$vector@I$01@@B", scope: !0, file: !1, line: 30, type: !65, isLocal: false, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!66 = !DIGlobalVariable(name: "kA", linkageName: "\01?kA@Constants@@3MB", scope: !0, file: !1, line: 31, type: !67, isLocal: false, isDefinition: true)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!68 = !DIGlobalVariable(name: "ColorTex", linkageName: "\01?ColorTex@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 26, type: !69, isLocal: false, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 26, size: 128, align: 32, elements: !2, templateParams: !70)
!70 = !{!71}
!71 = !DITemplateTypeParameter(name: "element", type: !38)
!72 = !{i32 2, !"Dwarf Version", i32 4}
!73 = !{i32 2, !"Debug Info Version", i32 3}
!74 = !{!"dxcoob 1.8.2502.11 (239921522)"}
