#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: fa659ffefd06c5fa407e4a2ff4c7ec17.pdb
; shader hash: fa659ffefd06c5fa407e4a2ff4c7ec17
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Compute Shader
; NumThreads=(8,8,1)
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 0
; SigOutputElements: 0
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 0
; SigOutputVectors[0]: 0
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       float FocusCenter;                            ; Offset:    0
;       float FocalSpread;                            ; Offset:    4
;       float FocalMinDist;                           ; Offset:    8
;       float FocalMaxDist;                           ; Offset:   12
;       float2 RcpBufferDim;                          ; Offset:   16
;       uint2 FullDimension;                          ; Offset:   24
;       int2 HalfDimensionMinusOne;                   ; Offset:   32

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !15, globals: !52)
!1 = !DIFile(filename: "Shaders\5CDoFPass1CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 59, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 59, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 59, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 59, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 59, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !{!16, !29, !42, !45, !48, !49, !50, !51}
!16 = !DISubprogram(name: "main", scope: !1, file: !1, line: 31, type: !17, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19, !28, !19, !19}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 21, baseType: !20)
!20 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 21, size: 96, align: 32, elements: !21, templateParams: !26)
!21 = !{!22, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !20, file: !1, line: 21, baseType: !23, size: 32, align: 32, flags: DIFlagPublic)
!23 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !20, file: !1, line: 21, baseType: !23, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !20, file: !1, line: 21, baseType: !23, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!26 = !{!27, !13}
!27 = !DITemplateTypeParameter(name: "element", type: !23)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 33, baseType: !23)
!29 = !DISubprogram(name: "Min4", linkageName: "\01?Min4@@YAMV?$vector@M$03@@@Z", scope: !30, file: !30, line: 53, type: !31, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!30 = !DIFile(filename: "Shaders/DoFCommon.hlsli", directory: "")
!31 = !DISubroutineType(types: !32)
!32 = !{!8, !33}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 34, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 34, size: 128, align: 32, elements: !35, templateParams: !40)
!35 = !{!36, !37, !38, !39}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 34, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !34, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !34, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!40 = !{!12, !41}
!41 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!42 = !DISubprogram(name: "Min4", linkageName: "\01?Min4@@YAMMMMM@Z", scope: !30, file: !30, line: 51, type: !43, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DISubroutineType(types: !44)
!44 = !{!8, !8, !8, !8, !8}
!45 = !DISubprogram(name: "Min3", linkageName: "\01?Min3@@YAMMMM@Z", scope: !30, file: !30, line: 48, type: !46, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{!8, !8, !8, !8}
!48 = !DISubprogram(name: "Max4", linkageName: "\01?Max4@@YAMV?$vector@M$03@@@Z", scope: !30, file: !30, line: 52, type: !31, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubprogram(name: "Max4", linkageName: "\01?Max4@@YAMMMMM@Z", scope: !30, file: !30, line: 50, type: !43, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false)
!50 = !DISubprogram(name: "Max3", linkageName: "\01?Max3@@YAMMMM@Z", scope: !30, file: !30, line: 47, type: !46, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false)
!51 = !DISubprogram(name: "MaxCoC", linkageName: "\01?MaxCoC@@YAMV?$vector@M$03@@@Z", scope: !1, file: !1, line: 23, type: !31, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false)
!52 = !{!53, !55, !56, !57, !58, !67, !75, !84, !85, !86, !88, !89, !90, !91, !92, !96, !97, !98, !100, !101, !102, !106, !110, !114, !117, !119, !121, !124}
!53 = !DIGlobalVariable(name: "FocusCenter", linkageName: "\01?FocusCenter@CB0@@3MB", scope: !0, file: !30, line: 24, type: !54, isLocal: false, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!55 = !DIGlobalVariable(name: "FocalSpread", linkageName: "\01?FocalSpread@CB0@@3MB", scope: !0, file: !30, line: 25, type: !54, isLocal: false, isDefinition: true)
!56 = !DIGlobalVariable(name: "FocalMinDist", linkageName: "\01?FocalMinDist@CB0@@3MB", scope: !0, file: !30, line: 26, type: !54, isLocal: false, isDefinition: true)
!57 = !DIGlobalVariable(name: "FocalMaxDist", linkageName: "\01?FocalMaxDist@CB0@@3MB", scope: !0, file: !30, line: 27, type: !54, isLocal: false, isDefinition: true)
!58 = !DIGlobalVariable(name: "RcpBufferDim", linkageName: "\01?RcpBufferDim@CB0@@3V?$vector@M$01@@B", scope: !0, file: !30, line: 28, type: !59, isLocal: false, isDefinition: true)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 28, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 28, size: 64, align: 32, elements: !62, templateParams: !65)
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !61, file: !1, line: 28, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !61, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!65 = !{!12, !66}
!66 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!67 = !DIGlobalVariable(name: "FullDimension", linkageName: "\01?FullDimension@CB0@@3V?$vector@I$01@@B", scope: !0, file: !30, line: 29, type: !68, isLocal: false, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 29, baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 29, size: 64, align: 32, elements: !71, templateParams: !74)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !70, file: !1, line: 29, baseType: !23, size: 32, align: 32, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !70, file: !1, line: 29, baseType: !23, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!74 = !{!27, !66}
!75 = !DIGlobalVariable(name: "HalfDimensionMinusOne", linkageName: "\01?HalfDimensionMinusOne@CB0@@3V?$vector@H$01@@B", scope: !0, file: !30, line: 30, type: !76, isLocal: false, isDefinition: true)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 30, baseType: !78)
!78 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 30, size: 64, align: 32, elements: !79, templateParams: !82)
!79 = !{!80, !81}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !78, file: !1, line: 30, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !78, file: !1, line: 30, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!82 = !{!83, !66}
!83 = !DITemplateTypeParameter(name: "element", type: !14)
!84 = !DIGlobalVariable(name: "TiledDimension", linkageName: "\01?TiledDimension@CB0@@3V?$vector@I$01@@B", scope: !0, file: !30, line: 31, type: !68, isLocal: false, isDefinition: true)
!85 = !DIGlobalVariable(name: "InvTiledDimension", linkageName: "\01?InvTiledDimension@CB0@@3V?$vector@M$01@@B", scope: !0, file: !30, line: 32, type: !59, isLocal: false, isDefinition: true)
!86 = !DIGlobalVariable(name: "DebugMode", linkageName: "\01?DebugMode@CB0@@3IB", scope: !0, file: !30, line: 33, type: !87, isLocal: false, isDefinition: true)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!88 = !DIGlobalVariable(name: "DisablePreFilter", linkageName: "\01?DisablePreFilter@CB0@@3IB", scope: !0, file: !30, line: 34, type: !87, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariable(name: "ForegroundRange", linkageName: "\01?ForegroundRange@CB0@@3MB", scope: !0, file: !30, line: 35, type: !54, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariable(name: "RcpForegroundRange", linkageName: "\01?RcpForegroundRange@CB0@@3MB", scope: !0, file: !30, line: 36, type: !54, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariable(name: "AntiSparkleFilterStrength", linkageName: "\01?AntiSparkleFilterStrength@CB0@@3MB", scope: !0, file: !30, line: 37, type: !54, isLocal: false, isDefinition: true)
!92 = !DIGlobalVariable(name: "gs_ClosestDepthSearch", linkageName: "\01?gs_ClosestDepthSearch@@3PAMA", scope: !0, file: !1, line: 19, type: !93, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_ClosestDepthSearch@@3PAMA")
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, align: 32, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 64)
!96 = !DIGlobalVariable(name: "gs_FarthestDepthSearch", linkageName: "\01?gs_FarthestDepthSearch@@3PAMA", scope: !0, file: !1, line: 20, type: !93, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_FarthestDepthSearch@@3PAMA")
!97 = !DIGlobalVariable(name: "gs_MaximumCoC", linkageName: "\01?gs_MaximumCoC@@3PAMA", scope: !0, file: !1, line: 21, type: !93, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_MaximumCoC@@3PAMA")
!98 = !DIGlobalVariable(name: "PointSampler", linkageName: "\01?PointSampler@@3USamplerState@@A", scope: !0, file: !30, line: 18, type: !99, isLocal: false, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 18, size: 32, align: 32, elements: !2)
!100 = !DIGlobalVariable(name: "ClampSampler", linkageName: "\01?ClampSampler@@3USamplerState@@A", scope: !0, file: !30, line: 19, type: !99, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariable(name: "BilinearSampler", linkageName: "\01?BilinearSampler@@3USamplerState@@A", scope: !0, file: !30, line: 20, type: !99, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariable(name: "s_Ring1", scope: !0, file: !30, line: 94, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 512, align: 32, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 8)
!106 = !DIGlobalVariable(name: "s_Ring2", scope: !0, file: !30, line: 102, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 1024, align: 32, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 16)
!110 = !DIGlobalVariable(name: "s_Ring3", scope: !0, file: !30, line: 114, type: !111, isLocal: true, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 1536, align: 32, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 24)
