#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: e0e79f39ed9a6ee11e4c19a179f40b90.pdb
; shader hash: e0e79f39ed9a6ee11e4c19a179f40b90
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Compute Shader
; NumThreads=(8,8,1)
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 0
; SigOutputElements: 0
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 0
; SigOutputVectors[0]: 0
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       float FocusCenter;                            ; Offset:    0
;       float FocalSpread;                            ; Offset:    4
;       float FocalMinDist;                           ; Offset:    8
;       float FocalMaxDist;                           ; Offset:   12
;       float2 RcpBufferDim;                          ; Offset:   16
;       uint2 FullDimension;                          ; Offset:   24
;       int2 HalfDimensionMinusOne;                   ; Offset:   32

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33, globals: !71)
!1 = !DIFile(filename: "Shaders\5CDoFPass2DebugCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !25}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 29, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 29, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 105, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 105, size: 128, align: 32, elements: !16, templateParams: !22)
!16 = !{!17, !19, !20, !21}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 105, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 105, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 105, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 105, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !18)
!24 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 115, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 115, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 115, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 115, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, line: 115, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!23, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!33 = !{!34, !45, !55, !59, !60, !66, !69, !70}
!34 = !DISubprogram(name: "main", scope: !35, file: !35, line: 78, type: !36, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!35 = !DIFile(filename: "Shaders/DoFPass2CS.hlsl", directory: "")
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38, !38}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 25, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 25, size: 96, align: 32, elements: !40, templateParams: !44)
!40 = !{!41, !42, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, line: 25, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !39, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !{!11, !32}
!45 = !DISubprogram(name: "PrefetchPixel", linkageName: "\01?PrefetchPixel@@YAXV?$vector@H$01@@V?$vector@I$01@@MM@Z", scope: !35, file: !35, line: 27, type: !46, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48, !4, !18, !18}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 30, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 30, size: 64, align: 32, elements: !50, templateParams: !53)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !49, file: !1, line: 30, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !49, file: !1, line: 30, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !{!54, !12}
!54 = !DITemplateTypeParameter(name: "element", type: !13)
!55 = !DISubprogram(name: "ForegroundPercent", linkageName: "\01?ForegroundPercent@@YAMMM@Z", scope: !56, file: !56, line: 70, type: !57, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DIFile(filename: "Shaders/DoFCommon.hlsli", directory: "")
!57 = !DISubroutineType(types: !58)
!58 = !{!18, !18, !18}
!59 = !DISubprogram(name: "BackgroundPercent", linkageName: "\01?BackgroundPercent@@YAMMM@Z", scope: !56, file: !56, line: 65, type: !57, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubprogram(name: "AccumulateOneRing", linkageName: "\01?AccumulateOneRing@@YAXIAIAV?$vector@M$03@@0@Z", scope: !35, file: !35, line: 55, type: !61, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !63, !64, !64}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 33, baseType: !8)
!64 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !14)
!66 = !DISubprogram(name: "AccumulateSample", linkageName: "\01?AccumulateSample@@YAXIMAIAV?$vector@M$03@@0@Z", scope: !35, file: !35, line: 41, type: !67, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !63, !18, !64, !64}
!69 = !DISubprogram(name: "AccumulateTwoRings", linkageName: "\01?AccumulateTwoRings@@YAXIAIAV?$vector@M$03@@0@Z", scope: !35, file: !35, line: 62, type: !61, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!70 = !DISubprogram(name: "AccumulateThreeRings", linkageName: "\01?AccumulateThreeRings@@YAXIAIAV?$vector@M$03@@0@Z", scope: !35, file: !35, line: 69, type: !61, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false)
!71 = !{!72, !74, !75, !76, !77, !85, !87, !89, !90, !91, !93, !94, !95, !96, !97, !101, !102, !103, !105, !106, !107, !111, !115, !119, !122, !124, !126, !130, !131, !132, !135, !137}
!72 = !DIGlobalVariable(name: "FocusCenter", linkageName: "\01?FocusCenter@CB0@@3MB", scope: !0, file: !56, line: 24, type: !73, isLocal: false, isDefinition: true)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!74 = !DIGlobalVariable(name: "FocalSpread", linkageName: "\01?FocalSpread@CB0@@3MB", scope: !0, file: !56, line: 25, type: !73, isLocal: false, isDefinition: true)
!75 = !DIGlobalVariable(name: "FocalMinDist", linkageName: "\01?FocalMinDist@CB0@@3MB", scope: !0, file: !56, line: 26, type: !73, isLocal: false, isDefinition: true)
!76 = !DIGlobalVariable(name: "FocalMaxDist", linkageName: "\01?FocalMaxDist@CB0@@3MB", scope: !0, file: !56, line: 27, type: !73, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariable(name: "RcpBufferDim", linkageName: "\01?RcpBufferDim@CB0@@3V?$vector@M$01@@B", scope: !0, file: !56, line: 28, type: !78, isLocal: false, isDefinition: true)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 28, baseType: !80)
!80 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 28, size: 64, align: 32, elements: !81, templateParams: !84)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !80, file: !1, line: 28, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !80, file: !1, line: 28, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!84 = !{!23, !12}
!85 = !DIGlobalVariable(name: "FullDimension", linkageName: "\01?FullDimension@CB0@@3V?$vector@I$01@@B", scope: !0, file: !56, line: 29, type: !86, isLocal: false, isDefinition: true)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!87 = !DIGlobalVariable(name: "HalfDimensionMinusOne", linkageName: "\01?HalfDimensionMinusOne@CB0@@3V?$vector@H$01@@B", scope: !0, file: !56, line: 30, type: !88, isLocal: false, isDefinition: true)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!89 = !DIGlobalVariable(name: "TiledDimension", linkageName: "\01?TiledDimension@CB0@@3V?$vector@I$01@@B", scope: !0, file: !56, line: 31, type: !86, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariable(name: "InvTiledDimension", linkageName: "\01?InvTiledDimension@CB0@@3V?$vector@M$01@@B", scope: !0, file: !56, line: 32, type: !78, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariable(name: "DebugMode", linkageName: "\01?DebugMode@CB0@@3IB", scope: !0, file: !56, line: 33, type: !92, isLocal: false, isDefinition: true)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!93 = !DIGlobalVariable(name: "DisablePreFilter", linkageName: "\01?DisablePreFilter@CB0@@3IB", scope: !0, file: !56, line: 34, type: !92, isLocal: false, isDefinition: true)
!94 = !DIGlobalVariable(name: "ForegroundRange", linkageName: "\01?ForegroundRange@CB0@@3MB", scope: !0, file: !56, line: 35, type: !73, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariable(name: "RcpForegroundRange", linkageName: "\01?RcpForegroundRange@CB0@@3MB", scope: !0, file: !56, line: 36, type: !73, isLocal: false, isDefinition: true)
!96 = !DIGlobalVariable(name: "AntiSparkleFilterStrength", linkageName: "\01?AntiSparkleFilterStrength@CB0@@3MB", scope: !0, file: !56, line: 37, type: !73, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariable(name: "gs_RG", linkageName: "\01?gs_RG@@3PAIA", scope: !0, file: !35, line: 23, type: !98, isLocal: false, isDefinition: true, variable: [576 x i32] addrspace(3)* @"\01?gs_RG@@3PAIA")
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 18432, align: 32, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 576)
!101 = !DIGlobalVariable(name: "gs_BW", linkageName: "\01?gs_BW@@3PAIA", scope: !0, file: !35, line: 24, type: !98, isLocal: false, isDefinition: true, variable: [576 x i32] addrspace(3)* @"\01?gs_BW@@3PAIA")
!102 = !DIGlobalVariable(name: "gs_CF", linkageName: "\01?gs_CF@@3PAIA", scope: !0, file: !35, line: 25, type: !98, isLocal: false, isDefinition: true, variable: [576 x i32] addrspace(3)* @"\01?gs_CF@@3PAIA")
!103 = !DIGlobalVariable(name: "PointSampler", linkageName: "\01?PointSampler@@3USamplerState@@A", scope: !0, file: !56, line: 18, type: !104, isLocal: false, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 18, size: 32, align: 32, elements: !2)
!105 = !DIGlobalVariable(name: "ClampSampler", linkageName: "\01?ClampSampler@@3USamplerState@@A", scope: !0, file: !56, line: 19, type: !104, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariable(name: "BilinearSampler", linkageName: "\01?BilinearSampler@@3USamplerState@@A", scope: !0, file: !56, line: 20, type: !104, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariable(name: "s_Ring1", scope: !0, file: !56, line: 94, type: !108, isLocal: true, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 512, align: 32, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 8)
!111 = !DIGlobalVariable(name: "s_Ring2", scope: !0, file: !56, line: 102, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 1024, align: 32, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 16)
