#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: b18404646592cffea4eee1df51d62977.pdb
; shader hash: b18404646592cffea4eee1df51d62977
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Compute Shader
; NumThreads=(8,8,1)
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 0
; SigOutputElements: 0
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 0
; SigOutputVectors[0]: 0
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       uint SrcMipLevel;                             ; Offset:    0
;       uint NumMipLevels;                            ; Offset:    4
;       float2 TexelSize;                             ; Offset:    8
;   
;   } CB0;                                            ; Offset:    0 Size:    16
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !51)
!1 = !DIFile(filename: "Shaders\5CGenerateMipsGammaCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 85, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 85, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 85, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 85, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 85, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 85, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !32, !35, !45, !48}
!17 = !DISubprogram(name: "main", scope: !18, file: !18, line: 75, type: !19, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DIFile(filename: "Shaders/GenerateMipsCS.hlsli", directory: "")
!19 = !DISubroutineType(types: !20)
!20 = !{null, !21, !23}
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 29, baseType: !22)
!22 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 40, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 40, size: 96, align: 32, elements: !25, templateParams: !29)
!25 = !{!26, !27, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, line: 40, baseType: !22, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, line: 40, baseType: !22, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !24, file: !1, line: 40, baseType: !22, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!30, !31}
!30 = !DITemplateTypeParameter(name: "element", type: !22)
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!32 = !DISubprogram(name: "PackColor", linkageName: "\01?PackColor@@YA?AV?$vector@M$03@@V1@@Z", scope: !18, file: !18, line: 64, type: !33, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false)
!33 = !DISubroutineType(types: !34)
!34 = !{!4, !4}
!35 = !DISubprogram(name: "ApplySRGBCurve", linkageName: "\01?ApplySRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !18, file: !18, line: 55, type: !36, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !38}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 71, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 71, size: 96, align: 32, elements: !40, templateParams: !44)
!40 = !{!41, !42, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, line: 71, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, line: 71, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !39, file: !1, line: 71, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !{!13, !31}
!45 = !DISubprogram(name: "StoreColor", linkageName: "\01?StoreColor@@YAXIV?$vector@M$03@@@Z", scope: !18, file: !18, line: 42, type: !46, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !21, !4}
!48 = !DISubprogram(name: "LoadColor", linkageName: "\01?LoadColor@@YA?AV?$vector@M$03@@I@Z", scope: !18, file: !18, line: 50, type: !49, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubroutineType(types: !50)
!50 = !{!4, !21}
!51 = !{!52, !54, !55, !64, !68, !69, !70, !71, !75, !76, !77, !78, !80}
!52 = !DIGlobalVariable(name: "SrcMipLevel", linkageName: "\01?SrcMipLevel@CB0@@3IB", scope: !0, file: !18, line: 29, type: !53, isLocal: false, isDefinition: true)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!54 = !DIGlobalVariable(name: "NumMipLevels", linkageName: "\01?NumMipLevels@CB0@@3IB", scope: !0, file: !18, line: 30, type: !53, isLocal: false, isDefinition: true)
!55 = !DIGlobalVariable(name: "TexelSize", linkageName: "\01?TexelSize@CB0@@3V?$vector@M$01@@B", scope: !0, file: !18, line: 31, type: !56, isLocal: false, isDefinition: true)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 31, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 31, size: 64, align: 32, elements: !59, templateParams: !62)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !58, file: !1, line: 31, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !58, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!62 = !{!13, !63}
!63 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!64 = !DIGlobalVariable(name: "gs_R", linkageName: "\01?gs_R@@3PAMA", scope: !0, file: !18, line: 37, type: !65, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_R@@3PAMA")
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, align: 32, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 64)
!68 = !DIGlobalVariable(name: "gs_G", linkageName: "\01?gs_G@@3PAMA", scope: !0, file: !18, line: 38, type: !65, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_G@@3PAMA")
!69 = !DIGlobalVariable(name: "gs_B", linkageName: "\01?gs_B@@3PAMA", scope: !0, file: !18, line: 39, type: !65, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_B@@3PAMA")
!70 = !DIGlobalVariable(name: "gs_A", linkageName: "\01?gs_A@@3PAMA", scope: !0, file: !18, line: 40, type: !65, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_A@@3PAMA")
!71 = !DIGlobalVariable(name: "OutMip1", linkageName: "\01?OutMip1@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !18, line: 20, type: !72, isLocal: false, isDefinition: true)
!72 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 20, size: 128, align: 32, elements: !2, templateParams: !73)
!73 = !{!74}
!74 = !DITemplateTypeParameter(name: "element", type: !5)
!75 = !DIGlobalVariable(name: "OutMip2", linkageName: "\01?OutMip2@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !18, line: 21, type: !72, isLocal: false, isDefinition: true)
!76 = !DIGlobalVariable(name: "OutMip3", linkageName: "\01?OutMip3@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !18, line: 22, type: !72, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariable(name: "OutMip4", linkageName: "\01?OutMip4@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !18, line: 23, type: !72, isLocal: false, isDefinition: true)
!78 = !DIGlobalVariable(name: "SrcMip", linkageName: "\01?SrcMip@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !18, line: 24, type: !79, isLocal: false, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 24, size: 160, align: 32, elements: !2, templateParams: !73)
!80 = !DIGlobalVariable(name: "BilinearClamp", linkageName: "\01?BilinearClamp@@3USamplerState@@A", scope: !0, file: !18, line: 25, type: !81, isLocal: false, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 25, size: 32, align: 32, elements: !2)
!82 = !{i32 2, !"Dwarf Version", i32 4}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = !{!"dxcoob 1.8.2502.11 (239921522)"}
!85 = !{!"Shaders\5CGenerateMipsGammaCS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A#define CONVERT_TO_SRGB\0D\0A#include \22GenerateMipsCS.hlsli\22\0D\0A"}
