#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: f8b42fc525c35b88af7987dbd96ac0d3.pdb
; shader hash: f8b42fc525c35b88af7987dbd96ac0d3
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Compute Shader
; NumThreads=(16,16,1)
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 0
; SigOutputElements: 0
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 0
; SigOutputVectors[0]: 0
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       float2 kRcpScale;                             ; Offset:    0
;   
;   } CB0;                                            ; Offset:    0 Size:     8
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; CB0                               cbuffer      NA          NA     CB0            cb0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !48, globals: !111)
!1 = !DIFile(filename: "Shaders\5CLanczosCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22, !29, !30}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 24, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 24, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 24, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 78, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 78, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 78, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 78, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 81, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 81, size: 64, align: 32, elements: !24, templateParams: !27)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 81, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 81, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !{!28, !12}
!28 = !DITemplateTypeParameter(name: "element", type: !13)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 49, baseType: !18)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x4", file: !1, line: 21, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 4>", file: !1, line: 21, size: 384, align: 32, elements: !32, templateParams: !45)
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!45 = !{!11, !46, !47}
!46 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!47 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!48 = !{!49, !60, !70, !83, !84, !87, !90, !93, !97, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110}
!49 = !DISubprogram(name: "main", scope: !1, file: !1, line: 71, type: !50, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !52, !52, !52, !29}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 49, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 49, size: 96, align: 32, elements: !54, templateParams: !58)
!54 = !{!55, !56, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !53, file: !1, line: 49, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !53, file: !1, line: 49, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !53, file: !1, line: 49, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!58 = !{!21, !59}
!59 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!60 = !DISubprogram(name: "StoreLDS", linkageName: "\01?StoreLDS@@YAXIV?$vector@M$02@@@Z", scope: !1, file: !1, line: 52, type: !61, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !29, !63}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 129, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 129, size: 96, align: 32, elements: !65, templateParams: !69)
!65 = !{!66, !67, !68}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !64, file: !1, line: 129, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !64, file: !1, line: 129, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !64, file: !1, line: 129, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!69 = !{!11, !59}
!70 = !DISubprogram(name: "GetUpscaleFilterWeights", linkageName: "\01?GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z", scope: !71, file: !71, line: 39, type: !72, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DIFile(filename: "Shaders/LanczosFunctions.hlsli", directory: "")
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !8}
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 104, baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 104, size: 128, align: 32, elements: !76, templateParams: !81)
!76 = !{!77, !78, !79, !80}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !75, file: !1, line: 104, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !75, file: !1, line: 104, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !75, file: !1, line: 104, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !75, file: !1, line: 104, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!81 = !{!11, !82}
!82 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!83 = !DISubprogram(name: "ComputeWeights", linkageName: "\01?ComputeWeights@@YA?AV?$vector@M$03@@M@Z", scope: !71, file: !71, line: 29, type: !72, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false)
!84 = !DISubprogram(name: "Lanczos", linkageName: "\01?Lanczos@@YAMMM@Z", scope: !71, file: !71, line: 23, type: !85, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DISubroutineType(types: !86)
!86 = !{!8, !8, !8}
!87 = !DISubprogram(name: "Sinc", linkageName: "\01?Sinc@@YAMM@Z", scope: !71, file: !71, line: 15, type: !88, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubroutineType(types: !89)
!89 = !{!8, !8}
!90 = !DISubprogram(name: "LoadSamples", linkageName: "\01?LoadSamples@@YA?AV?$matrix@M$02$03@@II@Z", scope: !1, file: !1, line: 60, type: !91, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DISubroutineType(types: !92)
!92 = !{!30, !29, !29}
!93 = !DISubprogram(name: "RemoveDisplayProfile", linkageName: "\01?RemoveDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !94, file: !94, line: 114, type: !95, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false)
!94 = !DIFile(filename: "Shaders/ShaderUtility.hlsli", directory: "")
!95 = !DISubroutineType(types: !96)
!96 = !{!63, !63, !13}
!97 = !DISubprogram(name: "RemoveSRGBCurve", linkageName: "\01?RemoveSRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !98, file: !98, line: 43, type: !99, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!98 = !DIFile(filename: "Shaders/ColorSpaceUtility.hlsli", directory: "")
!99 = !DISubroutineType(types: !100)
!100 = !{!63, !63}
!101 = !DISubprogram(name: "RGBLimitedToFull10bit", linkageName: "\01?RGBLimitedToFull10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !94, file: !94, line: 76, type: !99, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false)
!102 = !DISubprogram(name: "RemoveREC709Curve", linkageName: "\01?RemoveREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !98, file: !98, line: 68, type: !99, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false)
!103 = !DISubprogram(name: "REC2020toREC709", linkageName: "\01?REC2020toREC709@@YA?AV?$vector@M$02@@V1@@Z", scope: !98, file: !98, line: 131, type: !99, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!104 = !DISubprogram(name: "RemoveREC2084Curve", linkageName: "\01?RemoveREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !98, file: !98, line: 86, type: !99, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false)
!105 = !DISubprogram(name: "ApplyDisplayProfile", linkageName: "\01?ApplyDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !94, file: !94, line: 94, type: !95, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!106 = !DISubprogram(name: "ApplySRGBCurve", linkageName: "\01?ApplySRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !98, file: !98, line: 37, type: !99, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!107 = !DISubprogram(name: "RGBFullToLimited10bit", linkageName: "\01?RGBFullToLimited10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !94, file: !94, line: 71, type: !99, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!108 = !DISubprogram(name: "ApplyREC709Curve", linkageName: "\01?ApplyREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !98, file: !98, line: 63, type: !99, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!109 = !DISubprogram(name: "ApplyREC2084Curve", linkageName: "\01?ApplyREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !98, file: !98, line: 75, type: !99, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!110 = !DISubprogram(name: "REC709toREC2020", linkageName: "\01?REC709toREC2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !98, file: !98, line: 120, type: !99, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!111 = !{!112, !114, !118, !119, !120, !124, !126, !128, !144}
!112 = !DIGlobalVariable(name: "kRcpScale", linkageName: "\01?kRcpScale@CB0@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 24, type: !113, isLocal: false, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!114 = !DIGlobalVariable(name: "g_R", linkageName: "\01?g_R@@3PAMA", scope: !0, file: !1, line: 47, type: !115, isLocal: false, isDefinition: true, variable: [361 x float] addrspace(3)* @"\01?g_R@@3PAMA")
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 11552, align: 32, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 361)
!118 = !DIGlobalVariable(name: "g_G", linkageName: "\01?g_G@@3PAMA", scope: !0, file: !1, line: 48, type: !115, isLocal: false, isDefinition: true, variable: [361 x float] addrspace(3)* @"\01?g_G@@3PAMA")
!119 = !DIGlobalVariable(name: "g_B", linkageName: "\01?g_B@@3PAMA", scope: !0, file: !1, line: 49, type: !115, isLocal: false, isDefinition: true, variable: [361 x float] addrspace(3)* @"\01?g_B@@3PAMA")
!120 = !DIGlobalVariable(name: "Source", linkageName: "\01?Source@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 19, type: !121, isLocal: false, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 19, size: 128, align: 32, elements: !2, templateParams: !122)
!122 = !{!123}
!123 = !DITemplateTypeParameter(name: "element", type: !64)
!124 = !DIGlobalVariable(name: "Dest", linkageName: "\01?Dest@@3V?$RWTexture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 20, type: !125, isLocal: false, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 3> >", file: !1, line: 20, size: 96, align: 32, elements: !2, templateParams: !122)
!126 = !DIGlobalVariable(name: "M_PI", scope: !84, file: !71, line: 25, type: !127, isLocal: true, isDefinition: true)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!128 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC2020toREC709@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !103, file: !98, line: 133, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 133, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 133, size: 288, align: 32, elements: !132, templateParams: !142)
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140, !141}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !131, file: !1, line: 133, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !131, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !131, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !131, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !131, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !131, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !131, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !131, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !131, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!142 = !{!11, !46, !143}
!143 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!144 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC709toREC2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !110, file: !98, line: 122, type: !129, isLocal: false, isDefinition: true)
!145 = !{i32 2, !"Dwarf Version", i32 4}
!146 = !{i32 2, !"Debug Info Version", i32 3}
!147 = !{!"dxcoob 1.8.2502.11 (239921522)"}
