#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 0c6e34b7d676f54f2babe90b34617dbb.pdb
; shader hash: 0c6e34b7d676f54f2babe90b34617dbb
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Compute Shader
; NumThreads=(8,8,1)
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 0
; SigOutputElements: 0
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 0
; SigOutputVectors[0]: 0
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Buffer Definitions:
;
; cbuffer CBChangesPerView
; {
;
;   struct hostlayout.CBChangesPerView
;   {
;
;       column_major float4x4 gInvView;               ; Offset:    0
;       column_major float4x4 gViewProj;              ; Offset:   64
;       float gVertCotangent;                         ; Offset:  128
;       float gAspectRatio;                           ; Offset:  132
;       float gRcpFarZ;                               ; Offset:  136
;       float gInvertZ;                               ; Offset:  140

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !22, globals: !41)
!1 = !DIFile(filename: "Shaders\5CParticleDepthBoundsCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 42, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 42, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 84, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 84, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 84, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 84, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !{!23, !35, !38}
!23 = !DISubprogram(name: "main", scope: !1, file: !1, line: 43, type: !24, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !26, !34, !26}
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 22, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 22, size: 96, align: 32, elements: !28, templateParams: !32)
!28 = !{!29, !30, !31}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, line: 22, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, line: 22, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !27, file: !1, line: 22, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!32 = !{!21, !33}
!33 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 45, baseType: !18)
!35 = !DISubprogram(name: "Max4", linkageName: "\01?Max4@@YAXII@Z", scope: !1, file: !1, line: 24, type: !36, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !34, !34}
!38 = !DISubprogram(name: "PackMinMax", linkageName: "\01?PackMinMax@@YAII@Z", scope: !1, file: !1, line: 34, type: !39, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!39 = !DISubroutineType(types: !40)
!40 = !{!34, !34}
!41 = !{!42, !67, !68, !70, !71, !72, !73, !75, !76, !78, !79, !80, !81, !85, !87, !88, !89, !92, !95, !96}
!42 = !DIGlobalVariable(name: "gInvView", linkageName: "\01?gInvView@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !43, line: 34, type: !44, isLocal: false, isDefinition: true)
!43 = !DIFile(filename: "Shaders/ParticleUtility.hlsli", directory: "")
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 34, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !47, templateParams: !64)
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !46, file: !1, line: 34, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !46, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !46, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !46, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !46, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !46, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !46, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !46, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !46, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !46, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !46, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !46, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !46, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !46, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !46, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !46, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!64 = !{!11, !65, !66}
!65 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!66 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!67 = !DIGlobalVariable(name: "gViewProj", linkageName: "\01?gViewProj@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !43, line: 35, type: !44, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariable(name: "gVertCotangent", linkageName: "\01?gVertCotangent@CBChangesPerView@@3MB", scope: !0, file: !43, line: 37, type: !69, isLocal: false, isDefinition: true)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!70 = !DIGlobalVariable(name: "gAspectRatio", linkageName: "\01?gAspectRatio@CBChangesPerView@@3MB", scope: !0, file: !43, line: 38, type: !69, isLocal: false, isDefinition: true)
!71 = !DIGlobalVariable(name: "gRcpFarZ", linkageName: "\01?gRcpFarZ@CBChangesPerView@@3MB", scope: !0, file: !43, line: 39, type: !69, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariable(name: "gInvertZ", linkageName: "\01?gInvertZ@CBChangesPerView@@3MB", scope: !0, file: !43, line: 40, type: !69, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariable(name: "gBufferDim", linkageName: "\01?gBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !43, line: 42, type: !74, isLocal: false, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!75 = !DIGlobalVariable(name: "gRcpBufferDim", linkageName: "\01?gRcpBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !43, line: 43, type: !74, isLocal: false, isDefinition: true)
!76 = !DIGlobalVariable(name: "gBinsPerRow", linkageName: "\01?gBinsPerRow@CBChangesPerView@@3IB", scope: !0, file: !43, line: 45, type: !77, isLocal: false, isDefinition: true)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!78 = !DIGlobalVariable(name: "gTileRowPitch", linkageName: "\01?gTileRowPitch@CBChangesPerView@@3IB", scope: !0, file: !43, line: 46, type: !77, isLocal: false, isDefinition: true)
!79 = !DIGlobalVariable(name: "gTilesPerRow", linkageName: "\01?gTilesPerRow@CBChangesPerView@@3IB", scope: !0, file: !43, line: 47, type: !77, isLocal: false, isDefinition: true)
!80 = !DIGlobalVariable(name: "gTilesPerCol", linkageName: "\01?gTilesPerCol@CBChangesPerView@@3IB", scope: !0, file: !43, line: 48, type: !77, isLocal: false, isDefinition: true)
!81 = !DIGlobalVariable(name: "gs_Buffer", linkageName: "\01?gs_Buffer@@3PAIA", scope: !0, file: !1, line: 22, type: !82, isLocal: false, isDefinition: true, variable: [128 x i32] addrspace(3)* @"\01?gs_Buffer@@3PAIA")
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 4096, align: 32, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 128)
!85 = !DIGlobalVariable(name: "gSampLinearBorder", linkageName: "\01?gSampLinearBorder@@3USamplerState@@A", scope: !0, file: !43, line: 28, type: !86, isLocal: false, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 28, size: 32, align: 32, elements: !2)
!87 = !DIGlobalVariable(name: "gSampPointBorder", linkageName: "\01?gSampPointBorder@@3USamplerState@@A", scope: !0, file: !43, line: 29, type: !86, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariable(name: "gSampPointClamp", linkageName: "\01?gSampPointClamp@@3USamplerState@@A", scope: !0, file: !43, line: 30, type: !86, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariable(name: "g_Input", linkageName: "\01?g_Input@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 17, type: !90, isLocal: false, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 17, size: 64, align: 32, elements: !2, templateParams: !91)
!91 = !{!11}
!92 = !DIGlobalVariable(name: "g_Output8", linkageName: "\01?g_Output8@@3V?$RWTexture2D@I@@A", scope: !0, file: !1, line: 18, type: !93, isLocal: false, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<unsigned int>", file: !1, line: 18, size: 32, align: 32, elements: !2, templateParams: !94)
!94 = !{!21}
!95 = !DIGlobalVariable(name: "g_Output16", linkageName: "\01?g_Output16@@3V?$RWTexture2D@I@@A", scope: !0, file: !1, line: 19, type: !93, isLocal: false, isDefinition: true)
!96 = !DIGlobalVariable(name: "g_Output32", linkageName: "\01?g_Output32@@3V?$RWTexture2D@I@@A", scope: !0, file: !1, line: 20, type: !93, isLocal: false, isDefinition: true)
!97 = !{i32 2, !"Dwarf Version", i32 4}
!98 = !{i32 2, !"Debug Info Version", i32 3}
!99 = !{!"dxcoob 1.8.2502.11 (239921522)"}
!100 = !{!"Shaders\5CParticleDepthBoundsCS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author(s):  James Stanard \0D\0A//             Alex Nankervis\0D\0A//\0D\0A\0D\0A#include \22ParticleUtility.hlsli\22\0D\0A\0D\0ATexture2D<float> g_Input : register(t0);\0D\0ARWTexture2D<uint> g_Output8 : register(u0);\0D\0ARWTexture2D<uint> g_Output16 : register(u1);\0D\0ARWTexture2D<uint> g_Output32 : register(u2);\0D\0A\0D\0Agroupshared uint gs_Buffer[128];\0D\0A\0D\0Avoid Max4( uint This, uint Dx )\0D\0A{\0D\0A    uint MM1 = gs_Buffer[This + 1 * Dx];\0D\0A    uint MM2 = gs_Buffer[This + 8 * Dx];\0D\0A    uint MM3 = gs_Buffer[This + 9 * Dx];\0D\0A    GroupMemoryBarrierWithGroupSync();\0D\0A    InterlockedMax(gs_Buffer[This], max(MM1, max(MM2, MM3)));\0D\0A    GroupMemoryBarrierWithGroupSync();\0D\0A}\0D\0A\0D\0Auint PackMinMax( uint This )\0D\0A{\0D\0A    float Min = asfloat(~gs_Buffer[This + 64]);\0D\0A    float Max = asfloat(gs_Buffer[This]);\0D\0A    return f32tof16(Max) << 16 | f32tof16(saturate(Min - 0.001));\0D\0A}\0D\0A\0D\0A[RootSignature(Particle_RootSig)]\0D\0A[numthreads( 8, 8, 1 )]\0D\0Avoid main( uint3 Gid : SV_GroupID, uint GI : SV_GroupIndex, uint3 DTid : SV_DispatchThreadID )\0D\0A{\0D\0A    // Load 4x4 depth values (per thread) and compute the min and max of each\0D\0A    float2 UV1 = (DTid.xy * 4 + 1) * gRcpBufferDim;\0D\0A    float2 UV2 = UV1 + float2(2, 0) * gRcpBufferDim;\0D\0A    float2 UV3 = UV1 + float2(0, 2) * gRcpBufferDim;\0D\0A    float2 UV4 = UV1 + float2(2, 2) * gRcpBufferDim;\0D\0A    \0D\0A    float4 ZQuad1 = g_Input.Gather(gSampPointClamp, UV1);\0D\0A    float4 ZQuad2 = g_Input.Gather(gSampPointClamp, UV2);\0D\0A    float4 ZQuad3 = g_Input.Gather(gSampPointClamp, UV3);\0D\0A    float4 ZQuad4 = g_Input.Gather(gSampPointClamp, UV4);\0D\0A\0D\0A    float4 MaxQuad = max(max(ZQuad1, ZQuad2), max(ZQuad3, ZQuad4));\0D\0A    float4 MinQuad = min(min(ZQuad1, ZQuad2), min(ZQuad3, ZQuad4));\0D\0A\0D\0A    float maxZ = max(max(MaxQuad.x, MaxQuad.y), max(MaxQuad.z, MaxQuad.w));\0D\0A    float minZ = min(min(MinQuad.x, MinQuad.y), min(MinQuad.z, MinQuad.w));\0D\0A\0D\0A    // Parallel reduction will reduce 4:1 per iteration.  This reduces LDS loads and stores\0D\0A    // and can take advantage of min3 and max3 instructions when available.\0D\0A\0D\0A    // Because each iteration puts 3/4 of active threads to sleep, threads are quickly wasted.\0D\0A    // Rather than have each active thread compute both a min and a max, it would be nice if\0D\0A    // we could wake up sleeping threads to share the burden.  It turns out this is possible!\0D\0A    // We can have all threads performing Max4() reductions, and by applying it to negative\0D\0A    // min values, we can find the min depth.  E.g. min(a, b) = -max(-a, -b)\0D\0A\0D\0A    // Max values to first 64, Min values to last 64\0D\0A    gs_Buffer[GI] = asuint(maxZ);\0D\0A    gs_Buffer[GI + 64] = ~asuint(minZ);\0D\0A    GroupMemoryBarrierWithGroupSync();\0D\0A\0D\0A    // We don't need odd numbered threads, but we could utilize more threads\0D\0A    const uint This = GI * 2;\0D\0A\0D\0A    Max4(This, 1);\0D\0A\0D\0A    // if (X % 2 == 0 && Y % 2 == 0 && Y < 8)\0D\0A    if ((This & 0x49) == 0)    \0D\0A    {\0D\0A        uint2 SubTile = uint2(This >> 1, This >> 4) & 3;\0D\0A        g_Output8[Gid.xy * 4 + SubTile] = PackMinMax(This);\0D\0A    }\0D\0A\0D\0A    Max4(This, 2);\0D\0A\0D\0A    // if (X % 4 == 0 && Y % 4 == 0 && Y < 8)\0D\0A    if ((This & 0x5B) == 0)    \0D\0A    {\0D\0A        uint2 SubTile = uint2(This >> 2, This >> 5) & 1;\0D\0A        g_Output16[Gid.xy * 2 + SubTile] = PackMinMax(This);\0D\0A    }\0D\0A\0D\0A    Max4(This, 4);\0D\0A\0D\0A    if (This == 0)\0D\0A        g_Output32[Gid.xy] = PackMinMax(This);\0D\0A}\0D\0A"}
!101 = !{!"Shaders\5CParticleRS.hlsli", !"//\0A// Copyright (c) Microsoft. All rights reserved.\0A// This code is licensed under the MIT License (MIT).\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0A//\0A// Developed by Minigraph\0A//\0A// Author:  James Stanard \0A//\0A\0A#define Particle_RootSig \5C\0A    \22RootFlags(0), \22 \5C\0A    \22RootConstants(b0, num32BitConstants = 3),\22 \5C\0A    \22CBV(b1),\22 \5C\0A    \22CBV(b2),\22 \5C\0A    \22DescriptorTable(UAV(u0, numDescriptors = 8)),\22 \5C\0A    \22DescriptorTable(SRV(t0, numDescriptors = 10)),\22 \5C\0A    \22StaticSampler(s0,\22 \5C\0A        \22addressU = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22addressV = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22addressW = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22borderColor = STATIC_BORDER_COLOR_TRANSPARENT_BLACK,\22 \5C\0A        \22filter = FILTER_MIN_MAG_LINEAR_MIP_POINT),\22 \5C\0A    \22StaticSampler(s1,\22 \5C\0A        \22addressU = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22addressV = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22addressW = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22borderColor = STATIC_BORDER_COLOR_TRANSPARENT_BLACK,\22 \5C\0A        \22filter = FILTER_MIN_MAG_MIP_POINT), \22 \5C\0A    \22StaticSampler(s2,\22 \5C\0A        \22addressU = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22addressV = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22addressW = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22filter = FILTER_MIN_MAG_MIP_POINT)\22\0A"}
!102 = !{!"Shaders\5CParticleUtility.hlsli", !"//\0A// Copyright (c) Microsoft. All rights reserved.\0A// This code is licensed under the MIT License (MIT).\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0A//\0A// Developed by Minigraph\0A//\0A// Author(s):  Julia Careaga\0A//             James Stanard \0A//\0A\0A#include \22ParticleRS.hlsli\22\0A\0A#define MAX_PARTICLES_PER_BIN 1024\0A#define BIN_SIZE_X 128\0A#define BIN_SIZE_Y 64\0A#define TILE_SIZE 16\0A\0A#define TILES_PER_BIN_X (BIN_SIZE_X / TILE_SIZE)\0A#define TILES_PER_BIN_Y (BIN_SIZE_Y / TILE_SIZE)\0A#define TILES_PER_BIN (TILES_PER_BIN_X * TILES_PER_BIN_Y)\0A\0A#define MaxTextureSize 64\0A\0ASamplerState gSampLinearBorder : register(s0);\0ASamplerState gSampPointBorder : register(s1);\0ASamplerState gSampPointClamp : register(s2);\0A\0Acbuffer CBChangesPerView : register(b1)\0A{\0A    float4x4 gInvView;\0A    float4x4 gViewProj;\0A\0A    float gVertCotangent;\0A    float gAspectRatio;\0A    float gRcpFarZ;\0A    float gInvertZ;\0A\0A    float2 gBufferDim;\0A    float2 gRcpBufferDim;\0A\0A    uint gBinsPerRow;\0A    uint gTileRowPitch;\0A    uint gTilesPerRow;\0A    uint gTilesPerCol;\0A};\0A\0Astruct ParticleVertex\0A{\0A    float3 Position;\0A    float4 Color;\0A    float Size;\0A    uint TextureID;\0A};\0A\0A// Intentionally left unpacked to allow scalar register loads and ops\0Astruct ParticleScreenData\0A{\0A    float2 Corner;        // Top-left location\0A    float2 RcpSize;        // 1/width, 1/height\0A    float4 Color;\0A    float Depth;\0A    float TextureIndex;\0A    float TextureLevel;\0A    uint Bounds;\0A};\0A\0Auint InsertZeroBit( uint Value, uint BitIdx )\0A{\0A    uint Mask = BitIdx - 1;\0A    return (Value & ~Mask) << 1 | (Value & Mask);\0A}\0A"}
!103 = !{!"_GAMING_DESKTOP=1", !"_GAMING_DESKTOP=1"}
!104 = !{!"Shaders\5CParticleDepthBoundsCS.hlsl"}
!105 = !{!"-E", !"main", !"-T", !"cs_6_2", !"/D", !"_GAMING_DESKTOP=1", !"/Zi", !"-HV", !"2021", !"-Qembed_debug", !"-D", !"_GAMING_DESKTOP=1"}
!106 = !{i32 1, i32 2}
!107 = !{i32 1, i32 8}
!108 = !{!"cs", i32 6, i32 2}
!109 = !{!110, !113, !118, !120}
!110 = !{!111}
!111 = !{i32 0, %"class.Texture2D<float>"* undef, !"g_Input", i32 0, i32 0, i32 1, i32 2, i32 0, !112}
!112 = !{i32 0, i32 9}
!113 = !{!114, !116, !117}
!114 = !{i32 0, %"class.RWTexture2D<unsigned int>"* undef, !"g_Output8", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !115}
!115 = !{i32 0, i32 5}
!116 = !{i32 1, %"class.RWTexture2D<unsigned int>"* undef, !"g_Output16", i32 0, i32 1, i32 1, i32 2, i1 false, i1 false, i1 false, !115}
!117 = !{i32 2, %"class.RWTexture2D<unsigned int>"* undef, !"g_Output32", i32 0, i32 2, i32 1, i32 2, i1 false, i1 false, i1 false, !115}
!118 = !{!119}
!119 = !{i32 0, %hostlayout.CBChangesPerView* undef, !"CBChangesPerView", i32 0, i32 1, i32 1, i32 176, null}
!120 = !{!121}
!121 = !{i32 0, %struct.SamplerState* undef, !"gSampPointClamp", i32 0, i32 2, i32 1, i32 0, null}
!122 = !{i32 0, %hostlayout.CBChangesPerView undef, !123}
!123 = !{i32 176, !124, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136}
!124 = !{i32 6, !"gInvView", i32 2, !125, i32 3, i32 0, i32 7, i32 9}
!125 = !{i32 4, i32 4, i32 2}
!126 = !{i32 6, !"gViewProj", i32 2, !125, i32 3, i32 64, i32 7, i32 9}
!127 = !{i32 6, !"gVertCotangent", i32 3, i32 128, i32 7, i32 9}
!128 = !{i32 6, !"gAspectRatio", i32 3, i32 132, i32 7, i32 9}
!129 = !{i32 6, !"gRcpFarZ", i32 3, i32 136, i32 7, i32 9}
!130 = !{i32 6, !"gInvertZ", i32 3, i32 140, i32 7, i32 9}
!131 = !{i32 6, !"gBufferDim", i32 3, i32 144, i32 7, i32 9}
!132 = !{i32 6, !"gRcpBufferDim", i32 3, i32 152, i32 7, i32 9}
!133 = !{i32 6, !"gBinsPerRow", i32 3, i32 160, i32 7, i32 5}
!134 = !{i32 6, !"gTileRowPitch", i32 3, i32 164, i32 7, i32 5}
!135 = !{i32 6, !"gTilesPerRow", i32 3, i32 168, i32 7, i32 5}
!136 = !{i32 6, !"gTilesPerCol", i32 3, i32 172, i32 7, i32 5}
!137 = !{i32 1, void ()* @main, !138}
!138 = !{!139}
!139 = !{i32 0, !2, !2}
!140 = !{void ()* @main, !"main", null, !109, !141}
!141 = !{i32 4, !142}
!142 = !{i32 8, i32 8, i32 1}
!143 = !DILocation(line: 51, column: 21, scope: !23)
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "DTid", arg: 3, scope: !23, file: !1, line: 43, type: !26)
!145 = !DIExpression(DW_OP_bit_piece, 0, 32)
!146 = !DILocation(line: 43, column: 67, scope: !23)
!147 = !DIExpression(DW_OP_bit_piece, 32, 32)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GI", arg: 2, scope: !23, file: !1, line: 43, type: !34)
!149 = !DIExpression()
!150 = !DILocation(line: 43, column: 41, scope: !23)
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Gid", arg: 1, scope: !23, file: !1, line: 43, type: !26)
!152 = !DILocation(line: 43, column: 18, scope: !23)
!153 = !DILocation(line: 46, column: 27, scope: !23)
!154 = !DILocation(line: 46, column: 31, scope: !23)
!155 = !DILocation(line: 46, column: 18, scope: !23)
!156 = !DILocation(line: 46, column: 38, scope: !23)
!157 = !DILocation(line: 46, column: 36, scope: !23)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "UV1", scope: !23, file: !1, line: 46, type: !4)
!159 = !DILocation(line: 46, column: 12, scope: !23)
!160 = !DILocation(line: 47, column: 22, scope: !23)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "UV2", scope: !23, file: !1, line: 47, type: !4)
!162 = !DILocation(line: 47, column: 12, scope: !23)
!163 = !DILocation(line: 48, column: 22, scope: !23)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "UV3", scope: !23, file: !1, line: 48, type: !4)
!165 = !DILocation(line: 48, column: 12, scope: !23)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "UV4", scope: !23, file: !1, line: 49, type: !4)
!167 = !DILocation(line: 49, column: 12, scope: !23)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ZQuad1", scope: !23, file: !1, line: 51, type: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 51, baseType: !170)
!170 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 51, size: 128, align: 32, elements: !171, templateParams: !176)
!171 = !{!172, !173, !174, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !170, file: !1, line: 51, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !170, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !170, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !170, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!176 = !{!11, !177}
!177 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!178 = !DILocation(line: 51, column: 12, scope: !23)
!179 = !DILocation(line: 52, column: 21, scope: !23)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ZQuad2", scope: !23, file: !1, line: 52, type: !169)
!181 = !DILocation(line: 52, column: 12, scope: !23)
!182 = !DILocation(line: 53, column: 21, scope: !23)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ZQuad3", scope: !23, file: !1, line: 53, type: !169)
!184 = !DILocation(line: 53, column: 12, scope: !23)
!185 = !DILocation(line: 54, column: 21, scope: !23)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ZQuad4", scope: !23, file: !1, line: 54, type: !169)
!187 = !DILocation(line: 54, column: 12, scope: !23)
!188 = !DILocation(line: 56, column: 47, scope: !23)
!189 = !DILocation(line: 56, column: 26, scope: !23)
!190 = !DILocation(line: 56, column: 22, scope: !23)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "MaxQuad", scope: !23, file: !1, line: 56, type: !169)
!192 = !DILocation(line: 56, column: 12, scope: !23)
!193 = !DIExpression(DW_OP_bit_piece, 64, 32)
!194 = !DIExpression(DW_OP_bit_piece, 96, 32)
!195 = !DILocation(line: 57, column: 47, scope: !23)
!196 = !DILocation(line: 57, column: 26, scope: !23)
!197 = !DILocation(line: 57, column: 22, scope: !23)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "MinQuad", scope: !23, file: !1, line: 57, type: !169)
!199 = !DILocation(line: 57, column: 12, scope: !23)
!200 = !DILocation(line: 59, column: 49, scope: !23)
!201 = !DILocation(line: 59, column: 22, scope: !23)
!202 = !DILocation(line: 59, column: 18, scope: !23)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxZ", scope: !23, file: !1, line: 59, type: !8)
!204 = !DILocation(line: 59, column: 11, scope: !23)
!205 = !DILocation(line: 60, column: 49, scope: !23)
!206 = !DILocation(line: 60, column: 22, scope: !23)
!207 = !DILocation(line: 60, column: 18, scope: !23)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minZ", scope: !23, file: !1, line: 60, type: !8)
!209 = !DILocation(line: 60, column: 11, scope: !23)
!210 = !DILocation(line: 72, column: 5, scope: !23)
!211 = !DILocation(line: 72, column: 19, scope: !23)
!212 = !{!213, !213, i64 0}
!213 = !{!"int", !214, i64 0}
!214 = !{!"omnipotent char", !215, i64 0}
!215 = !{!"Simple C/C++ TBAA"}
!216 = !DILocation(line: 73, column: 27, scope: !23)
!217 = !DILocation(line: 73, column: 26, scope: !23)
!218 = !DILocation(line: 73, column: 18, scope: !23)
!219 = !DILocation(line: 73, column: 5, scope: !23)
!220 = !DILocation(line: 73, column: 24, scope: !23)
!221 = !DILocation(line: 74, column: 5, scope: !23)
!222 = !DILocation(line: 77, column: 26, scope: !23)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "This", scope: !23, file: !1, line: 77, type: !77)
!224 = !DILocation(line: 77, column: 16, scope: !23)
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Dx", arg: 2, scope: !35, file: !1, line: 24, type: !34)
!226 = !DILocation(line: 24, column: 28, scope: !35, inlinedAt: !227)
!227 = distinct !DILocation(line: 79, column: 5, scope: !23)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "This", arg: 1, scope: !35, file: !1, line: 24, type: !34)
!229 = !DILocation(line: 24, column: 17, scope: !35, inlinedAt: !227)
!230 = !DILocation(line: 26, column: 31, scope: !35, inlinedAt: !227)
!231 = !DILocation(line: 26, column: 16, scope: !35, inlinedAt: !227)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "MM1", scope: !35, file: !1, line: 26, type: !34)
!233 = !DILocation(line: 26, column: 10, scope: !35, inlinedAt: !227)
!234 = !DILocation(line: 27, column: 31, scope: !35, inlinedAt: !227)
