#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: cb5c77c21c1f87a8a86a92aee7e9d330.pdb
; shader hash: cb5c77c21c1f87a8a86a92aee7e9d330
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Compute Shader
; NumThreads=(4,64,1)
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 0
; SigOutputElements: 0
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 0
; SigOutputVectors[0]: 0
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Buffer Definitions:
;
; cbuffer CBChangesPerView
; {
;
;   struct hostlayout.CBChangesPerView
;   {
;
;       column_major float4x4 gInvView;               ; Offset:    0
;       column_major float4x4 gViewProj;              ; Offset:   64
;       float gVertCotangent;                         ; Offset:  128
;       float gAspectRatio;                           ; Offset:  132
;       float gRcpFarZ;                               ; Offset:  136
;       float gInvertZ;                               ; Offset:  140

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !14, globals: !27)
!1 = !DIFile(filename: "Shaders\5CParticleBinCullingCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 29, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 29, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !{!15}
!15 = !DISubprogram(name: "main", scope: !1, file: !1, line: 34, type: !16, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!16 = !DISubroutineType(types: !17)
!17 = !{null, !18, !26, !18}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 29, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 29, size: 96, align: 32, elements: !20, templateParams: !24)
!20 = !{!21, !22, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !19, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !19, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !19, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!24 = !{!11, !25}
!25 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 45, baseType: !8)
!27 = !{!28, !55, !56, !58, !59, !60, !61, !69, !70, !72, !73, !74, !75, !79, !81, !83, !84, !85, !107, !110, !112, !114}
!28 = !DIGlobalVariable(name: "gInvView", linkageName: "\01?gInvView@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !29, line: 34, type: !30, isLocal: false, isDefinition: true)
!29 = !DIFile(filename: "Shaders/ParticleUtility.hlsli", directory: "")
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 34, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !33, templateParams: !51)
!33 = !{!34, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !32, file: !1, line: 34, baseType: !35, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !32, file: !1, line: 34, baseType: !35, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !32, file: !1, line: 34, baseType: !35, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !32, file: !1, line: 34, baseType: !35, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !32, file: !1, line: 34, baseType: !35, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !32, file: !1, line: 34, baseType: !35, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !32, file: !1, line: 34, baseType: !35, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !32, file: !1, line: 34, baseType: !35, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !32, file: !1, line: 34, baseType: !35, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !32, file: !1, line: 34, baseType: !35, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !32, file: !1, line: 34, baseType: !35, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !32, file: !1, line: 34, baseType: !35, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !32, file: !1, line: 34, baseType: !35, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !32, file: !1, line: 34, baseType: !35, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !32, file: !1, line: 34, baseType: !35, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !32, file: !1, line: 34, baseType: !35, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!51 = !{!52, !53, !54}
!52 = !DITemplateTypeParameter(name: "element", type: !35)
!53 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!54 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!55 = !DIGlobalVariable(name: "gViewProj", linkageName: "\01?gViewProj@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !29, line: 35, type: !30, isLocal: false, isDefinition: true)
!56 = !DIGlobalVariable(name: "gVertCotangent", linkageName: "\01?gVertCotangent@CBChangesPerView@@3MB", scope: !0, file: !29, line: 37, type: !57, isLocal: false, isDefinition: true)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!58 = !DIGlobalVariable(name: "gAspectRatio", linkageName: "\01?gAspectRatio@CBChangesPerView@@3MB", scope: !0, file: !29, line: 38, type: !57, isLocal: false, isDefinition: true)
!59 = !DIGlobalVariable(name: "gRcpFarZ", linkageName: "\01?gRcpFarZ@CBChangesPerView@@3MB", scope: !0, file: !29, line: 39, type: !57, isLocal: false, isDefinition: true)
!60 = !DIGlobalVariable(name: "gInvertZ", linkageName: "\01?gInvertZ@CBChangesPerView@@3MB", scope: !0, file: !29, line: 40, type: !57, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariable(name: "gBufferDim", linkageName: "\01?gBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !29, line: 42, type: !62, isLocal: false, isDefinition: true)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 42, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 42, size: 64, align: 32, elements: !65, templateParams: !68)
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !64, file: !1, line: 42, baseType: !35, size: 32, align: 32, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !64, file: !1, line: 42, baseType: !35, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!68 = !{!52, !12}
!69 = !DIGlobalVariable(name: "gRcpBufferDim", linkageName: "\01?gRcpBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !29, line: 43, type: !62, isLocal: false, isDefinition: true)
!70 = !DIGlobalVariable(name: "gBinsPerRow", linkageName: "\01?gBinsPerRow@CBChangesPerView@@3IB", scope: !0, file: !29, line: 45, type: !71, isLocal: false, isDefinition: true)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!72 = !DIGlobalVariable(name: "gTileRowPitch", linkageName: "\01?gTileRowPitch@CBChangesPerView@@3IB", scope: !0, file: !29, line: 46, type: !71, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariable(name: "gTilesPerRow", linkageName: "\01?gTilesPerRow@CBChangesPerView@@3IB", scope: !0, file: !29, line: 47, type: !71, isLocal: false, isDefinition: true)
!74 = !DIGlobalVariable(name: "gTilesPerCol", linkageName: "\01?gTilesPerCol@CBChangesPerView@@3IB", scope: !0, file: !29, line: 48, type: !71, isLocal: false, isDefinition: true)
!75 = !DIGlobalVariable(name: "gs_BinCounters", linkageName: "\01?gs_BinCounters@@3PAIA", scope: !0, file: !1, line: 25, type: !76, isLocal: false, isDefinition: true, variable: [16 x i32] addrspace(3)* @"\01?gs_BinCounters@@3PAIA")
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 512, align: 32, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 16)
!79 = !DIGlobalVariable(name: "LogTilesPerBin", linkageName: "\01?LogTilesPerBin@CB0@@3V?$vector@I$01@@B", scope: !0, file: !1, line: 29, type: !80, isLocal: false, isDefinition: true)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!81 = !DIGlobalVariable(name: "gSampLinearBorder", linkageName: "\01?gSampLinearBorder@@3USamplerState@@A", scope: !0, file: !29, line: 28, type: !82, isLocal: false, isDefinition: true)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 28, size: 32, align: 32, elements: !2)
!83 = !DIGlobalVariable(name: "gSampPointBorder", linkageName: "\01?gSampPointBorder@@3USamplerState@@A", scope: !0, file: !29, line: 29, type: !82, isLocal: false, isDefinition: true)
!84 = !DIGlobalVariable(name: "gSampPointClamp", linkageName: "\01?gSampPointClamp@@3USamplerState@@A", scope: !0, file: !29, line: 30, type: !82, isLocal: false, isDefinition: true)
!85 = !DIGlobalVariable(name: "g_VisibleParticles", linkageName: "\01?g_VisibleParticles@@3V?$StructuredBuffer@UParticleScreenData@@@@A", scope: !0, file: !1, line: 19, type: !86, isLocal: false, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ParticleScreenData>", file: !1, line: 19, size: 384, align: 32, elements: !2, templateParams: !87)
!87 = !{!88}
!88 = !DITemplateTypeParameter(name: "element", type: !89)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleScreenData", file: !29, line: 60, size: 384, align: 32, elements: !90)
!90 = !{!91, !92, !93, !103, !104, !105, !106}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Corner", scope: !89, file: !29, line: 62, baseType: !63, size: 64, align: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "RcpSize", scope: !89, file: !29, line: 63, baseType: !63, size: 64, align: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !89, file: !29, line: 64, baseType: !94, size: 128, align: 32, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 19, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 19, size: 128, align: 32, elements: !96, templateParams: !101)
!96 = !{!97, !98, !99, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !95, file: !1, line: 19, baseType: !35, size: 32, align: 32, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !95, file: !1, line: 19, baseType: !35, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !95, file: !1, line: 19, baseType: !35, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !95, file: !1, line: 19, baseType: !35, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!101 = !{!52, !102}
!102 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !89, file: !29, line: 65, baseType: !35, size: 32, align: 32, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "TextureIndex", scope: !89, file: !29, line: 66, baseType: !35, size: 32, align: 32, offset: 288)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "TextureLevel", scope: !89, file: !29, line: 67, baseType: !35, size: 32, align: 32, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Bounds", scope: !89, file: !29, line: 68, baseType: !26, size: 32, align: 32, offset: 352)
!107 = !DIGlobalVariable(name: "g_LargeBinParticles", linkageName: "\01?g_LargeBinParticles@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 20, type: !108, isLocal: false, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 20, size: 32, align: 32, elements: !2, templateParams: !109)
!109 = !{!11}
!110 = !DIGlobalVariable(name: "g_LargeBinCounters", linkageName: "\01?g_LargeBinCounters@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 21, type: !111, isLocal: false, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 21, size: 32, align: 32, elements: !2)
!112 = !DIGlobalVariable(name: "g_BinParticles", linkageName: "\01?g_BinParticles@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 22, type: !113, isLocal: false, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 22, size: 32, align: 32, elements: !2, templateParams: !109)
!114 = !DIGlobalVariable(name: "g_BinCounters", linkageName: "\01?g_BinCounters@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 23, type: !115, isLocal: false, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 23, size: 32, align: 32, elements: !2)
!116 = !{i32 2, !"Dwarf Version", i32 4}
!117 = !{i32 2, !"Debug Info Version", i32 3}
!118 = !{!"dxcoob 1.8.2502.11 (239921522)"}
