#if 0
;
; Note: shader requires additional functionality:
;       Typed UAV Load Additional Formats
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 28e28dd50a5d4d89cb06374a95b10f2e.pdb
; shader hash: 28e28dd50a5d4d89cb06374a95b10f2e
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Compute Shader
; NumThreads=(8,8,1)
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 0
; SigOutputElements: 0
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 0
; SigOutputVectors[0]: 0
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Buffer Definitions:
;
; cbuffer CBChangesPerView
; {
;
;   struct hostlayout.CBChangesPerView
;   {
;
;       column_major float4x4 gInvView;               ; Offset:    0
;       column_major float4x4 gViewProj;              ; Offset:   64
;       float gVertCotangent;                         ; Offset:  128
;       float gAspectRatio;                           ; Offset:  132
;       float gRcpFarZ;                               ; Offset:  136

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !30, globals: !108)
!1 = !DIFile(filename: "Shaders\5CParticleTileRenderFastDynamic2CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 204, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 204, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 204, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 204, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 42, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 42, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 42, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 42, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 51, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 30, size: 96, align: 32, elements: !24, templateParams: !28)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 30, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !{!21, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!30 = !{!31, !43, !68, !92, !97, !101, !102, !105}
!31 = !DISubprogram(name: "main", scope: !32, file: !32, line: 201, type: !33, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!32 = !DIFile(filename: "Shaders/ParticleTileRenderCS.hlsl", directory: "")
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35, !42, !35}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 26, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 26, size: 96, align: 32, elements: !37, templateParams: !41)
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, line: 26, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!41 = !{!11, !29}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 45, baseType: !8)
!43 = !DISubprogram(name: "RenderParticles", linkageName: "\01?RenderParticles@@YA?AV?$matrix@M$03$03@@V?$vector@I$01@@0III@Z", scope: !32, file: !32, line: 119, type: !44, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false)
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !4, !4, !42, !42, !42}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 34, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !48, templateParams: !65)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !47, file: !1, line: 34, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !47, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !47, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !47, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !47, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !47, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !47, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !47, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !47, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !47, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !47, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !47, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !47, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !47, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !47, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !47, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!65 = !{!21, !66, !67}
!66 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!67 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!68 = !DISubprogram(name: "BlendHighRes", linkageName: "\01?BlendHighRes@@YAXAIAV?$matrix@M$03$03@@UParticleScreenData@@V?$vector@M$01@@V?$vector@M$03@@@Z", scope: !32, file: !32, line: 64, type: !69, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !71, !73, !14, !79}
!71 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !46)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleScreenData", file: !74, line: 60, size: 384, align: 32, elements: !75)
!74 = !DIFile(filename: "Shaders/ParticleUtility.hlsli", directory: "")
!75 = !{!76, !77, !78, !88, !89, !90, !91}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Corner", scope: !73, file: !74, line: 62, baseType: !14, size: 64, align: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "RcpSize", scope: !73, file: !74, line: 63, baseType: !14, size: 64, align: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !73, file: !74, line: 64, baseType: !79, size: 128, align: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 35, baseType: !80)
!80 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 35, size: 128, align: 32, elements: !81, templateParams: !86)
!81 = !{!82, !83, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !80, file: !1, line: 35, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !80, file: !1, line: 35, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !80, file: !1, line: 35, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !80, file: !1, line: 35, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!86 = !{!21, !87}
!87 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !73, file: !74, line: 65, baseType: !18, size: 32, align: 32, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "TextureIndex", scope: !73, file: !74, line: 66, baseType: !18, size: 32, align: 32, offset: 288)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "TextureLevel", scope: !73, file: !74, line: 67, baseType: !18, size: 32, align: 32, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Bounds", scope: !73, file: !74, line: 68, baseType: !42, size: 32, align: 32, offset: 352)
!92 = !DISubprogram(name: "BlendPixel", linkageName: "\01?BlendPixel@@YAXAIAV?$vector@M$03@@V1@M@Z", scope: !32, file: !32, line: 59, type: !93, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !95, !79, !18}
!95 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !79)
!97 = !DISubprogram(name: "SampleParticleColor", linkageName: "\01?SampleParticleColor@@YA?AV?$vector@M$03@@UParticleScreenData@@USamplerState@@V?$vector@M$01@@M@Z", scope: !32, file: !32, line: 47, type: !98, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false)
!98 = !DISubroutineType(types: !99)
!99 = !{!79, !73, !100, !14, !18}
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 28, size: 32, align: 32, elements: !2)
!101 = !DISubprogram(name: "BlendLowRes", linkageName: "\01?BlendLowRes@@YAXAIAV?$matrix@M$03$03@@UParticleScreenData@@V?$vector@M$01@@V?$vector@M$03@@@Z", scope: !32, file: !32, line: 87, type: !69, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false)
!102 = !DISubprogram(name: "WriteBlendedQuad", linkageName: "\01?WriteBlendedQuad@@YAXV?$vector@I$01@@V?$matrix@M$03$03@@@Z", scope: !32, file: !32, line: 111, type: !103, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !4, !46}
!105 = !DISubprogram(name: "WriteBlendedColor", linkageName: "\01?WriteBlendedColor@@YAXV?$vector@I$01@@V?$vector@M$03@@@Z", scope: !32, file: !32, line: 100, type: !106, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !4, !79}
!108 = !{!109, !111, !112, !114, !115, !116, !117, !119, !120, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !135, !139, !141, !145, !148}
!109 = !DIGlobalVariable(name: "gInvView", linkageName: "\01?gInvView@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !74, line: 34, type: !110, isLocal: false, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!111 = !DIGlobalVariable(name: "gViewProj", linkageName: "\01?gViewProj@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !74, line: 35, type: !110, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariable(name: "gVertCotangent", linkageName: "\01?gVertCotangent@CBChangesPerView@@3MB", scope: !0, file: !74, line: 37, type: !113, isLocal: false, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!114 = !DIGlobalVariable(name: "gAspectRatio", linkageName: "\01?gAspectRatio@CBChangesPerView@@3MB", scope: !0, file: !74, line: 38, type: !113, isLocal: false, isDefinition: true)
!115 = !DIGlobalVariable(name: "gRcpFarZ", linkageName: "\01?gRcpFarZ@CBChangesPerView@@3MB", scope: !0, file: !74, line: 39, type: !113, isLocal: false, isDefinition: true)
!116 = !DIGlobalVariable(name: "gInvertZ", linkageName: "\01?gInvertZ@CBChangesPerView@@3MB", scope: !0, file: !74, line: 40, type: !113, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariable(name: "gBufferDim", linkageName: "\01?gBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !74, line: 42, type: !118, isLocal: false, isDefinition: true)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!119 = !DIGlobalVariable(name: "gRcpBufferDim", linkageName: "\01?gRcpBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !74, line: 43, type: !118, isLocal: false, isDefinition: true)
