#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TexCoord                 0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyz         0   TARGET   float   xyz 
;
; shader debug name: eeb4120df3234c3aac4fbc2e5ac57413.pdb
; shader hash: eeb4120df3234c3aac4fbc2e5ac57413
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 2
; SigOutputElements: 1
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 2
; SigOutputVectors[0]: 1
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TexCoord                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !49)
!1 = !DIFile(filename: "Shaders\5CSharpeningUpsamplePS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !34, !37, !41, !45, !46, !47, !48}
!4 = !DISubprogram(name: "main", scope: !1, file: !1, line: 40, type: !5, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DISubroutineType(types: !6)
!6 = !{!7, !18, !27}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 26, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 26, size: 96, align: 32, elements: !9, templateParams: !14)
!9 = !{!10, !12, !13}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, line: 26, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, line: 26, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !8, file: !1, line: 26, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!14 = !{!15, !16}
!15 = !DITemplateTypeParameter(name: "element", type: !11)
!16 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 3)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 26, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 26, size: 128, align: 32, elements: !20, templateParams: !25)
!20 = !{!21, !22, !23, !24}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !19, file: !1, line: 26, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !19, file: !1, line: 26, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !19, file: !1, line: 26, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !19, file: !1, line: 26, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!25 = !{!15, !26}
!26 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 4)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 24, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 24, size: 64, align: 32, elements: !29, templateParams: !32)
!29 = !{!30, !31}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !28, file: !1, line: 24, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !28, file: !1, line: 24, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!32 = !{!15, !33}
!33 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 2)
!34 = !DISubprogram(name: "GetColor", linkageName: "\01?GetColor@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 29, type: !35, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false)
!35 = !DISubroutineType(types: !36)
!36 = !{!7, !27}
!37 = !DISubprogram(name: "ApplyDisplayProfile", linkageName: "\01?ApplyDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !38, file: !38, line: 94, type: !39, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!38 = !DIFile(filename: "Shaders/ShaderUtility.hlsli", directory: "")
!39 = !DISubroutineType(types: !40)
!40 = !{!7, !7, !17}
!41 = !DISubprogram(name: "ApplySRGBCurve", linkageName: "\01?ApplySRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !42, file: !42, line: 37, type: !43, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!42 = !DIFile(filename: "Shaders/ColorSpaceUtility.hlsli", directory: "")
!43 = !DISubroutineType(types: !44)
!44 = !{!7, !7}
!45 = !DISubprogram(name: "RGBFullToLimited10bit", linkageName: "\01?RGBFullToLimited10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !38, file: !38, line: 71, type: !43, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubprogram(name: "ApplyREC709Curve", linkageName: "\01?ApplyREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !42, file: !42, line: 63, type: !43, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DISubprogram(name: "ApplyREC2084Curve", linkageName: "\01?ApplyREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !42, file: !42, line: 75, type: !43, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubprogram(name: "REC709toREC2020", linkageName: "\01?REC709toREC2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !42, file: !42, line: 120, type: !43, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!49 = !{!50, !52, !53, !55, !56, !60, !62}
!50 = !DIGlobalVariable(name: "UVOffset0", linkageName: "\01?UVOffset0@Constants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 24, type: !51, isLocal: false, isDefinition: true)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!52 = !DIGlobalVariable(name: "UVOffset1", linkageName: "\01?UVOffset1@Constants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 25, type: !51, isLocal: false, isDefinition: true)
!53 = !DIGlobalVariable(name: "WA", linkageName: "\01?WA@Constants@@3MB", scope: !0, file: !1, line: 26, type: !54, isLocal: false, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!55 = !DIGlobalVariable(name: "WB", linkageName: "\01?WB@Constants@@3MB", scope: !0, file: !1, line: 26, type: !54, isLocal: false, isDefinition: true)
!56 = !DIGlobalVariable(name: "ColorTex", linkageName: "\01?ColorTex@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 19, type: !57, isLocal: false, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 19, size: 128, align: 32, elements: !2, templateParams: !58)
!58 = !{!59}
!59 = !DITemplateTypeParameter(name: "element", type: !8)
!60 = !DIGlobalVariable(name: "BilinearClamp", linkageName: "\01?BilinearClamp@@3USamplerState@@A", scope: !0, file: !1, line: 20, type: !61, isLocal: false, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 20, size: 32, align: 32, elements: !2)
!62 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC709toREC2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !48, file: !42, line: 122, type: !63, isLocal: false, isDefinition: true)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 122, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 122, size: 288, align: 32, elements: !66, templateParams: !76)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !65, file: !1, line: 122, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !65, file: !1, line: 122, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !65, file: !1, line: 122, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !65, file: !1, line: 122, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !65, file: !1, line: 122, baseType: !11, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !65, file: !1, line: 122, baseType: !11, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !65, file: !1, line: 122, baseType: !11, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !65, file: !1, line: 122, baseType: !11, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !65, file: !1, line: 122, baseType: !11, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!76 = !{!15, !77, !78}
!77 = !DITemplateValueParameter(name: "row_count", type: !17, value: i32 3)
!78 = !DITemplateValueParameter(name: "col_count", type: !17, value: i32 3)
!79 = !{i32 2, !"Dwarf Version", i32 4}
!80 = !{i32 2, !"Debug Info Version", i32 3}
!81 = !{!"dxcoob 1.8.2502.11 (239921522)"}
!82 = !{!"Shaders\5CSharpeningUpsamplePS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A// This is a bilinear filter coupled with a sharpening pass flattened into one pass.\0D\0A//\0D\0A\0D\0A#include \22ShaderUtility.hlsli\22\0D\0A#include \22PresentRS.hlsli\22\0D\0A\0D\0ATexture2D<float3> ColorTex : register(t0);\0D\0ASamplerState BilinearClamp : register(s0);\0D\0A\0D\0Acbuffer Constants : register(b0)\0D\0A{\0D\0A    float2 UVOffset0;   // Four UV offsets to determine the sharpening tap locations\0D\0A    float2 UVOffset1;   // We get two more offsets by negating these two.\0D\0A    float WA, WB;       // Sharpness strength:  WB = 1.0 + Sharpness; 4*WA + WB = 1\0D\0A}\0D\0A\0D\0Afloat3 GetColor(float2 UV)\0D\0A{\0D\0A    float3 Color = ColorTex.SampleLevel(BilinearClamp, UV, 0);\0D\0A#ifdef GAMMA_SPACE\0D\0A    return ApplyDisplayProfile(Color, DISPLAY_PLANE_FORMAT);\0D\0A#else\0D\0A    return Color;\0D\0A#endif\0D\0A}\0D\0A\0D\0A[RootSignature(Present_RootSig)]\0D\0Afloat3 main(float4 position : SV_Position, float2 uv : TexCoord0) : SV_Target0\0D\0A{\0D\0A    float3 Color = WB * GetColor(uv) - WA * (\0D\0A        GetColor(uv + UVOffset0) + GetColor(uv - UVOffset0) +\0D\0A        GetColor(uv + UVOffset1) + GetColor(uv - UVOffset1));\0D\0A\0D\0A#ifdef GAMMA_SPACE\0D\0A    return Color;\0D\0A#else\0D\0A    return ApplyDisplayProfile(Color, DISPLAY_PLANE_FORMAT);\0D\0A#endif\0D\0A}\0D\0A"}
