#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: ba8fab45958eb3745e910d22691c364e.pdb
; shader hash: ba8fab45958eb3745e910d22691c364e
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Compute Shader
; NumThreads=(8,8,1)
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 0
; SigOutputElements: 0
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 0
; SigOutputVectors[0]: 0
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Buffer Definitions:
;
; cbuffer CB1
; {
;
;   struct CB1
;   {
;
;       float2 RcpBufferDim;                          ; Offset:    0
;       float TemporalBlendFactor;                    ; Offset:    8
;       float RcpSpeedLimiter;                        ; Offset:   12
;       float2 ViewportJitter;                        ; Offset:   16
;   
;   } CB1;                                            ; Offset:    0 Size:    24
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !100)
!1 = !DIFile(filename: "Shaders\5CTemporalBlendCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22, !30, !39}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 174, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 174, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 174, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 174, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 40, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 40, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 40, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 40, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 186, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 186, size: 96, align: 32, elements: !24, templateParams: !28)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 186, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 186, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 186, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !{!21, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 177, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 177, size: 128, align: 32, elements: !32, templateParams: !37)
!32 = !{!33, !34, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, line: 177, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, line: 177, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !31, file: !1, line: 177, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !31, file: !1, line: 177, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!37 = !{!21, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 174, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 174, size: 64, align: 32, elements: !41, templateParams: !44)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, line: 174, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, line: 174, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !{!45, !12}
!45 = !DITemplateTypeParameter(name: "element", type: !13)
!46 = !{!47, !58, !61, !66, !69, !72, !74, !77, !78, !83, !86, !89, !92, !96, !99}
!47 = !DISubprogram(name: "main", scope: !1, file: !1, line: 163, type: !48, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50, !57, !50, !50}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 43, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 43, size: 96, align: 32, elements: !52, templateParams: !56)
!52 = !{!53, !54, !55}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !51, file: !1, line: 43, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !51, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !51, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!56 = !{!11, !29}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 43, baseType: !8)
!58 = !DISubprogram(name: "StoreRGB", linkageName: "\01?StoreRGB@@YAXIV?$vector@M$02@@@Z", scope: !1, file: !1, line: 46, type: !59, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !57, !22}
!61 = !DISubprogram(name: "GetBBoxForPair", linkageName: "\01?GetBBoxForPair@@YAXIIAIAV?$vector@M$02@@0@Z", scope: !1, file: !1, line: 73, type: !62, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !57, !57, !64, !64}
!64 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !22)
!66 = !DISubprogram(name: "LoadRGB", linkageName: "\01?LoadRGB@@YA?AV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 53, type: !67, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false)
!67 = !DISubroutineType(types: !68)
!68 = !{!22, !57}
!69 = !DISubprogram(name: "ApplyTemporalBlend", linkageName: "\01?ApplyTemporalBlend@@YAXV?$vector@I$01@@IV?$vector@M$02@@1@Z", scope: !1, file: !1, line: 114, type: !70, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !4, !57, !22, !22}
!72 = !DISubprogram(name: "UnpackVelocity", linkageName: "\01?UnpackVelocity@@YA?AV?$vector@M$02@@I@Z", scope: !73, file: !73, line: 57, type: !67, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DIFile(filename: "Shaders/PixelPacking_Velocity.hlsli", directory: "")
!74 = !DISubprogram(name: "UnpackXY", linkageName: "\01?UnpackXY@@YAMI@Z", scope: !73, file: !73, line: 32, type: !75, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{!18, !57}
!77 = !DISubprogram(name: "UnpackZ", linkageName: "\01?UnpackZ@@YAMI@Z", scope: !73, file: !73, line: 45, type: !75, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubprogram(name: "GetClosestPixel", linkageName: "\01?GetClosestPixel@@YA?AV?$vector@H$01@@IAIAM@Z", scope: !1, file: !1, line: 92, type: !79, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{!39, !57, !81}
!81 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !18)
!83 = !DISubprogram(name: "MaxOf", linkageName: "\01?MaxOf@@YAMV?$vector@M$03@@@Z", scope: !1, file: !1, line: 90, type: !84, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false)
!84 = !DISubroutineType(types: !85)
!85 = !{!18, !30}
!86 = !DISubprogram(name: "STtoUV", linkageName: "\01?STtoUV@@YA?AV?$vector@M$01@@V1@@Z", scope: !1, file: !1, line: 58, type: !87, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DISubroutineType(types: !88)
!88 = !{!14, !14}
!89 = !DISubprogram(name: "ClipColor", linkageName: "\01?ClipColor@@YA?AV?$vector@M$02@@V1@00M@Z", scope: !1, file: !1, line: 63, type: !90, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!90 = !DISubroutineType(types: !91)
!91 = !{!22, !22, !22, !22, !18}
!92 = !DISubprogram(name: "ITM", linkageName: "\01?ITM@@YA?AV?$vector@M$02@@V1@@Z", scope: !93, file: !93, line: 54, type: !94, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false)
