#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xy          0     NONE   float   xy  
; TEXCOORD                 0   xyzw        1     NONE    uint   xyzw
; SV_VertexID              0   x           2   VERTID    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
;
; shader debug name: 4dba0def14355304563acebe7d335a5b.pdb
; shader hash: 4dba0def14355304563acebe7d335a5b
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 3
; SigOutputElements: 2
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 3
; SigOutputVectors[0]: 2
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !23, globals: !46)
!1 = !DIFile(filename: "Shaders\5CTextVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 18, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 18, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 24, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 24, size: 128, align: 32, elements: !16, templateParams: !21)
!16 = !{!17, !18, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 24, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!21 = !{!11, !22}
!22 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!23 = !{!24}
!24 = !DISubprogram(name: "main", scope: !1, file: !1, line: 40, type: !25, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !31, !45}
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "VS_OUTPUT", file: !1, line: 33, size: 192, align: 32, elements: !28)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", scope: !27, file: !1, line: 35, baseType: !14, size: 128, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Tex", scope: !27, file: !1, line: 36, baseType: !4, size: 64, align: 32, offset: 128)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "VS_INPUT", file: !1, line: 27, size: 192, align: 32, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ScreenPos", scope: !31, file: !1, line: 29, baseType: !4, size: 64, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Glyph", scope: !31, file: !1, line: 30, baseType: !35, size: 128, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 24, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 24, size: 128, align: 32, elements: !37, templateParams: !43)
!37 = !{!38, !40, !41, !42}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, line: 24, baseType: !39, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, line: 24, baseType: !39, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, line: 24, baseType: !39, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !36, file: !1, line: 24, baseType: !39, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!43 = !{!44, !22}
!44 = !DITemplateTypeParameter(name: "element", type: !39)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 24, baseType: !39)
!46 = !{!47, !49, !50, !51, !53, !54, !55}
!47 = !DIGlobalVariable(name: "Scale", linkageName: "\01?Scale@cbFontParams@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 18, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!49 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@cbFontParams@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 19, type: !48, isLocal: false, isDefinition: true)
!50 = !DIGlobalVariable(name: "InvTexDim", linkageName: "\01?InvTexDim@cbFontParams@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 20, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariable(name: "TextSize", linkageName: "\01?TextSize@cbFontParams@@3MB", scope: !0, file: !1, line: 21, type: !52, isLocal: false, isDefinition: true)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!53 = !DIGlobalVariable(name: "TextScale", linkageName: "\01?TextScale@cbFontParams@@3MB", scope: !0, file: !1, line: 22, type: !52, isLocal: false, isDefinition: true)
!54 = !DIGlobalVariable(name: "DstBorder", linkageName: "\01?DstBorder@cbFontParams@@3MB", scope: !0, file: !1, line: 23, type: !52, isLocal: false, isDefinition: true)
!55 = !DIGlobalVariable(name: "SrcBorder", linkageName: "\01?SrcBorder@cbFontParams@@3IB", scope: !0, file: !1, line: 24, type: !56, isLocal: false, isDefinition: true)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!57 = !{i32 2, !"Dwarf Version", i32 4}
!58 = !{i32 2, !"Debug Info Version", i32 3}
!59 = !{!"dxcoob 1.8.2502.11 (239921522)"}
!60 = !{!"Shaders\5CTextVS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A#include \22TextRS.hlsli\22\0D\0A\0D\0Acbuffer cbFontParams : register(b0)\0D\0A{\0D\0A    float2 Scale;            // Scale and offset for transforming coordinates\0D\0A    float2 Offset;\0D\0A    float2 InvTexDim;        // Normalizes texture coordinates\0D\0A    float TextSize;            // Height of text in destination pixels\0D\0A    float TextScale;        // TextSize / FontHeight\0D\0A    float DstBorder;        // Extra space around a glyph measured in screen space coordinates\0D\0A    uint SrcBorder;            // Extra spacing around glyphs to avoid sampling neighboring glyphs\0D\0A}\0D\0A\0D\0Astruct VS_INPUT\0D\0A{\0D\0A    float2 ScreenPos : POSITION;    // Upper-left position in screen pixel coordinates\0D\0A    uint4  Glyph : TEXCOORD;        // X, Y, Width, Height in texel space\0D\0A};\0D\0A\0D\0Astruct VS_OUTPUT\0D\0A{\0D\0A    float4 Pos : SV_POSITION;    // Upper-left and lower-right coordinates in clip space\0D\0A    float2 Tex : TEXCOORD0;        // Upper-left and lower-right normalized UVs\0D\0A};\0D\0A\0D\0A[RootSignature(Text_RootSig)]\0D\0AVS_OUTPUT main( VS_INPUT input, uint VertID : SV_VertexID )\0D\0A{\0D\0A    const float2 xy0 = input.ScreenPos - DstBorder;\0D\0A    const float2 xy1 = input.ScreenPos + DstBorder + float2(TextScale * input.Glyph.z, TextSize);\0D\0A    const uint2 uv0 = input.Glyph.xy - SrcBorder;\0D\0A    const uint2 uv1 = input.Glyph.xy + SrcBorder + input.Glyph.zw;\0D\0A\0D\0A    float2 uv = float2( VertID & 1, (VertID >> 1) & 1 );\0D\0A\0D\0A    VS_OUTPUT output;\0D\0A    output.Pos = float4( lerp(xy0, xy1, uv) * Scale + Offset, 0, 1 );\0D\0A    output.Tex = lerp(uv0, uv1, uv) * InvTexDim;\0D\0A    return output;\0D\0A}\0D\0A"}
!61 = !{!"Shaders\5CTextRS.hlsli", !"//\0A// Copyright (c) Microsoft. All rights reserved.\0A// This code is licensed under the MIT License (MIT).\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0A//\0A// Developed by Minigraph\0A//\0A// Author:  James Stanard \0A//\0A\0A#define Text_RootSig \5C\0A    \22RootFlags(ALLOW_INPUT_ASSEMBLER_INPUT_LAYOUT), \22 \5C\0A    \22CBV(b0, visibility = SHADER_VISIBILITY_VERTEX),\22 \5C\0A    \22CBV(b0, visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0A    \22DescriptorTable(SRV(t0, numDescriptors = 1), visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0A    \22StaticSampler(s0, visibility = SHADER_VISIBILITY_PIXEL,\22 \5C\0A        \22addressU = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22addressV = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22addressW = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22filter = FILTER_MIN_MAG_MIP_LINEAR)\22\0A"}
!62 = !{!"_GAMING_DESKTOP=1", !"_GAMING_DESKTOP=1"}
!63 = !{!"Shaders\5CTextVS.hlsl"}
!64 = !{!"-E", !"main", !"-T", !"vs_6_2", !"/D", !"_GAMING_DESKTOP=1", !"/Zi", !"-HV", !"2021", !"-Qembed_debug", !"-D", !"_GAMING_DESKTOP=1"}
!65 = !{i32 1, i32 2}
!66 = !{i32 1, i32 8}
!67 = !{!"vs", i32 6, i32 2}
!68 = !{null, null, !69, null}
!69 = !{!70}
!70 = !{i32 0, %cbFontParams* undef, !"cbFontParams", i32 0, i32 0, i32 1, i32 40, null}
!71 = !{i32 0, %cbFontParams undef, !72}
!72 = !{i32 40, !73, !74, !75, !76, !77, !78, !79}
!73 = !{i32 6, !"Scale", i32 3, i32 0, i32 7, i32 9}
!74 = !{i32 6, !"Offset", i32 3, i32 8, i32 7, i32 9}
!75 = !{i32 6, !"InvTexDim", i32 3, i32 16, i32 7, i32 9}
!76 = !{i32 6, !"TextSize", i32 3, i32 24, i32 7, i32 9}
!77 = !{i32 6, !"TextScale", i32 3, i32 28, i32 7, i32 9}
!78 = !{i32 6, !"DstBorder", i32 3, i32 32, i32 7, i32 9}
!79 = !{i32 6, !"SrcBorder", i32 3, i32 36, i32 7, i32 5}
!80 = !{i32 1, void ()* @main, !81}
!81 = !{!82}
!82 = !{i32 0, !2, !2}
!83 = !{[11 x i32] [i32 9, i32 6, i32 1, i32 2, i32 0, i32 0, i32 16, i32 32, i32 17, i32 32, i32 51]}
!84 = !{void ()* @main, !"main", !85, !68, null}
!85 = !{!86, !94, null}
!86 = !{!87, !90, !92}
!87 = !{i32 0, !"POSITION", i8 9, i8 0, !88, i8 0, i32 1, i8 2, i32 0, i8 0, !89}
!88 = !{i32 0}
!89 = !{i32 3, i32 3}
!90 = !{i32 1, !"TEXCOORD", i8 5, i8 0, !88, i8 0, i32 1, i8 4, i32 1, i8 0, !91}
!91 = !{i32 3, i32 15}
!92 = !{i32 2, !"SV_VertexID", i8 5, i8 1, !88, i8 0, i32 1, i8 1, i32 2, i8 0, !93}
!93 = !{i32 3, i32 1}
!94 = !{!95, !96}
!95 = !{i32 0, !"SV_Position", i8 9, i8 3, !88, i8 4, i32 1, i8 4, i32 0, i8 0, !91}
!96 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !88, i8 2, i32 1, i8 2, i32 1, i8 0, !89}
!97 = !DILocation(line: 40, column: 26, scope: !24)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !24, file: !1, line: 40, type: !31)
!99 = !DIExpression(DW_OP_bit_piece, 64, 32)
!100 = !DIExpression(DW_OP_bit_piece, 96, 32)
!101 = !DIExpression(DW_OP_bit_piece, 128, 32)
!102 = !DIExpression(DW_OP_bit_piece, 160, 32)
!103 = !DIExpression(DW_OP_bit_piece, 0, 32)
!104 = !DIExpression(DW_OP_bit_piece, 32, 32)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "VertID", arg: 2, scope: !24, file: !1, line: 40, type: !45)
!106 = !DIExpression()
!107 = !DILocation(line: 40, column: 38, scope: !24)
!108 = !DILocation(line: 42, column: 42, scope: !24)
!109 = !DILocation(line: 42, column: 40, scope: !24)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy0", scope: !24, file: !1, line: 42, type: !48)
!111 = !DILocation(line: 42, column: 18, scope: !24)
!112 = !DILocation(line: 43, column: 61, scope: !24)
!113 = !DILocation(line: 43, column: 73, scope: !24)
!114 = !DILocation(line: 43, column: 71, scope: !24)
!115 = !DILocation(line: 43, column: 88, scope: !24)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy1", scope: !24, file: !1, line: 43, type: !48)
!117 = !DILocation(line: 43, column: 18, scope: !24)
!118 = !DILocation(line: 44, column: 40, scope: !24)
!119 = !DILocation(line: 44, column: 38, scope: !24)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv0", scope: !24, file: !1, line: 44, type: !121)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 44, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 44, size: 64, align: 32, elements: !124, templateParams: !127)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !123, file: !1, line: 44, baseType: !39, size: 32, align: 32, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !123, file: !1, line: 44, baseType: !39, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!127 = !{!44, !12}
!128 = !DILocation(line: 44, column: 17, scope: !24)
!129 = !DILocation(line: 45, column: 38, scope: !24)
!130 = !DILocation(line: 45, column: 50, scope: !24)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv1", scope: !24, file: !1, line: 45, type: !121)
!132 = !DILocation(line: 45, column: 17, scope: !24)
!133 = !DILocation(line: 47, column: 32, scope: !24)
!134 = !DILocation(line: 47, column: 25, scope: !24)
!135 = !DILocation(line: 47, column: 45, scope: !24)
!136 = !DILocation(line: 47, column: 51, scope: !24)
!137 = !DILocation(line: 47, column: 37, scope: !24)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !24, file: !1, line: 47, type: !4)
!139 = !DILocation(line: 47, column: 12, scope: !24)
!140 = !DILocation(line: 43, column: 52, scope: !24)
!141 = !DILocation(line: 50, column: 26, scope: !24)
!142 = !DILocation(line: 50, column: 47, scope: !24)
!143 = !DILocation(line: 50, column: 45, scope: !24)
!144 = !DILocation(line: 50, column: 55, scope: !24)
!145 = !DILocation(line: 50, column: 53, scope: !24)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output", scope: !24, file: !1, line: 49, type: !27)
!147 = !DILocation(line: 49, column: 15, scope: !24)
!148 = !DILocation(line: 51, column: 28, scope: !24)
!149 = !DILocation(line: 51, column: 23, scope: !24)
!150 = !DILocation(line: 51, column: 18, scope: !24)
!151 = !DILocation(line: 51, column: 39, scope: !24)
!152 = !DILocation(line: 51, column: 37, scope: !24)
!153 = !DILocation(line: 52, column: 12, scope: !24)
!154 = !DILocation(line: 52, column: 5, scope: !24)

#endif

const unsigned char g_pTextVS[] = {
  0x44, 0x58, 0x42, 0x43, 0xac, 0x92, 0xe4, 0x31, 0xac, 0x11, 0x8e, 0x0b,
  0x5e, 0x79, 0x04, 0xe7, 0xf6, 0xe1, 0x80, 0xa0, 0x01, 0x00, 0x00, 0x00,
  0x6c, 0x33, 0x00, 0x00, 0x0a, 0x00, 0x00, 0x00, 0x48, 0x00, 0x00, 0x00,
  0x58, 0x00, 0x00, 0x00, 0xe8, 0x00, 0x00, 0x00, 0x50, 0x01, 0x00, 0x00,
  0x64, 0x02, 0x00, 0x00, 0x14, 0x03, 0x00, 0x00, 0x34, 0x24, 0x00, 0x00,
  0x80, 0x2b, 0x00, 0x00, 0xb4, 0x2b, 0x00, 0x00, 0xd0, 0x2b, 0x00, 0x00,
  0x53, 0x46, 0x49, 0x30, 0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x49, 0x53, 0x47, 0x31, 0x88, 0x00, 0x00, 0x00,
  0x03, 0x00, 0x00, 0x00, 0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x68, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x03, 0x03, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x71, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
  0x01, 0x00, 0x00, 0x00, 0x0f, 0x0f, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x7a, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x06, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00,
  0x01, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x50, 0x4f, 0x53, 0x49,
  0x54, 0x49, 0x4f, 0x4e, 0x00, 0x54, 0x45, 0x58, 0x43, 0x4f, 0x4f, 0x52,
  0x44, 0x00, 0x53, 0x56, 0x5f, 0x56, 0x65, 0x72, 0x74, 0x65, 0x78, 0x49,
  0x44, 0x00, 0x00, 0x00, 0x4f, 0x53, 0x47, 0x31, 0x60, 0x00, 0x00, 0x00,
  0x02, 0x00, 0x00, 0x00, 0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x48, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
  0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x0f, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x54, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x03, 0x00, 0x00, 0x00,
  0x01, 0x00, 0x00, 0x00, 0x03, 0x0c, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x53, 0x56, 0x5f, 0x50, 0x6f, 0x73, 0x69, 0x74, 0x69, 0x6f, 0x6e, 0x00,
  0x54, 0x45, 0x58, 0x43, 0x4f, 0x4f, 0x52, 0x44, 0x00, 0x00, 0x00, 0x00,
  0x50, 0x53, 0x56, 0x30, 0x0c, 0x01, 0x00, 0x00, 0x34, 0x00, 0x00, 0x00,
